[
  {
    "role-name": "Generative Designer",
    "description": "A Generative Designer is a digital professional who uses algorithms, code, and other computational tools to create designs. They are a hybrid of a designer and a programmer, with a passion for using technology to explore new creative possibilities. They are experts in creating systems that can generate a wide range of design variations, often in response to data or user input.\n",
    "industry": "Architecture, Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and develop generative systems and algorithms.\n- Use code and other computational tools to create a wide range of design outputs, from graphics and animations to 3D models and architectural forms.\n- Collaborate with other designers, artists, and engineers to integrate generative techniques into creative projects.\n- Explore and experiment with new and emerging technologies in the field of generative design.\n- Curate and select the most compelling outputs from generative systems.\n- Stay current with the latest trends and best practices in generative art and design.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in a variety of programming languages and creative coding frameworks, such as JavaScript, Python, Processing, or openFrameworks.\n- A strong understanding of design principles, including typography, color, and composition.\n- A passion for experimentation and a creative mindset.\n- Excellent problem-solving and collaboration skills.\n- A portfolio that showcases a strong ability to use code to create innovative and compelling designs.\n"
  },
  {
    "role-name": "Director Of Design",
    "description": "A Director of Design is a senior leader who is responsible for the overall design vision, strategy, and execution for a company, a business unit, or a product line. They are a visionary and a mentor, with a passion for building and leading high-performing design teams. They are responsible for setting the bar for design excellence and for ensuring that the design team is creating work that is both beautiful and effective.\n",
    "industry": "Tech, Enterprise\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the design vision and strategy for the organization.\n- Lead and mentor a team of designers and design managers, providing guidance, feedback, and career development.\n- Oversee the design of all products, services, and experiences, ensuring a high standard of quality and consistency.\n- Collaborate with other leaders in product, engineering, and marketing to ensure a cohesive and integrated brand and user experience.\n- Champion a user-centered design culture throughout the organization.\n- Attract, hire, and retain top design talent.\n- Manage the design budget and resources.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in a variety of design disciplines, such as UX design, product design, or brand design.\n- A compelling portfolio of work that demonstrates a commitment to design excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing design teams.\n"
  },
  {
    "role-name": "Vp Of Research",
    "description": "A VP of Research is a senior executive who is responsible for the overall research vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing research teams. They are responsible for setting the bar for research excellence and for ensuring that the research team is generating insights that inform and inspire the design of products, services, and experiences. They are a key member of the executive team and play a critical role in shaping the company's strategy and culture.\n",
    "industry": "Tech\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the research vision and strategy for the company.\n- Lead and mentor a team of research directors and managers, providing guidance, feedback, and career development.\n- Oversee all research activities, ensuring a high standard of quality and rigor.\n- Collaborate with other executives to ensure that research is integrated into the entire business.\n- Champion a user-centered and data-informed culture throughout the company.\n- Attract, hire, and retain top research talent.\n- Manage the research budget and resources.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in a wide range of qualitative and quantitative research methods.\n- A compelling track record of generating and communicating user insights that have had a significant impact on product and business decisions.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing research teams.\n"
  },
  {
    "role-name": "Design Lead",
    "description": "A Design Lead is a senior designer who is responsible for the design execution and quality for a specific product, project, or team. They are a hands-on leader who is both a skilled designer and a mentor to other designers. They are responsible for ensuring that the design work is aligned with the project's goals, and for guiding the team to create a high-quality, user-centered experience.\n",
    "industry": "Tech, Agency\n",
    "medium": "Digital\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead the design of a specific product, project, or feature from concept to completion.\n- Provide guidance, feedback, and mentorship to other designers on the team.\n- Collaborate with product managers, engineers, and other stakeholders to ensure a cohesive and user-centered product.\n- Facilitate design critiques and reviews to ensure a high standard of quality.\n- Advocate for the user and for design best practices.\n- Contribute to the development of the design team's culture and processes.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in a variety of design disciplines, such as UX design, product design, or visual design.\n- Strong leadership and mentoring skills.\n- Excellent communication, collaboration, and presentation skills.\n- A passion for creating high-quality, user-centered experiences.\n- A strong portfolio that demonstrates a deep understanding of the design process and a track record of success.\n- Ability to provide and receive constructive feedback.\n"
  },
  {
    "role-name": "Vibe Designer",
    "description": "A Vibe Designer is a creative professional who specializes in the curation of the atmosphere and mood of a space or experience. They are a hybrid of a designer, a curator, and a DJ, with a deep understanding of how to use sensory inputs to create a desired emotional response. They are passionate about creating immersive and memorable experiences that transport people to another place.\n",
    "industry": "Events, Hospitality\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of sensory experiences, from music playlists and lighting designs to scent profiles and tactile installations.\n- Collaborate with clients, event planners, and other stakeholders to understand the desired mood and atmosphere.\n- Develop and execute a cohesive sensory strategy for a space or experience.\n- Stay current with the latest trends and best practices in sensory design.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of sensory design.\n- A deep understanding of how to use music, lighting, scent, and other sensory inputs to create a desired emotional response.\n- A strong portfolio that showcases a range of sensory design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for creating immersive experiences.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Designops Manager",
    "description": "A DesignOps Manager is a people leader who is responsible for the health, happiness, and performance of a team of DesignOps professionals. They are a coach, a mentor, and a facilitator, with a passion for helping the DesignOps team do their best work. They are responsible for creating a supportive and collaborative environment where the DesignOps team can learn, grow, and thrive.\n",
    "industry": "Tech, Enterprise\n",
    "medium": "Service\n",
    "org-level": "Manager\n",
    "responsibilities": "- Manage a team of DesignOps professionals, including hiring, onboarding, performance reviews, and career development.\n- Provide coaching, mentorship, and guidance to the DesignOps team.\n- Foster a positive and inclusive team culture.\n- Manage the team's workload and resources.\n- Facilitate communication and collaboration within the DesignOps team and with other departments.\n- Advocate for the needs of the DesignOps team.\n- Continuously improve the DesignOps team's processes and workflows.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and people management skills.\n- A deep understanding of DesignOps principles and practices.\n- Excellent coaching, mentoring, and facilitation skills.\n- Strong communication and interpersonal skills.\n- A passion for building and leading high-performing teams.\n- Experience in a DesignOps role is often a plus.\n"
  },
  {
    "role-name": "Chief Marketing Officer (Cmo)",
    "description": "A Chief Marketing Officer (CMO) is a senior executive responsible for a company's overall marketing strategy and execution. They are tasked with driving revenue growth, building brand equity, and creating a strong connection with customers. The CMO is a strategic leader who is responsible for all aspects of the marketing function, from brand and advertising to digital marketing and customer insights.\n",
    "industry": "All\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and execute a comprehensive marketing strategy that is aligned with the company's business goals.\n- Lead and mentor a high-performing marketing team.\n- Oversee all marketing activities, including brand management, advertising, public relations, content marketing, and digital marketing.\n- Drive customer acquisition, engagement, and retention.\n- Manage the marketing budget and ensure a positive return on investment.\n- Use data and analytics to measure the effectiveness of marketing campaigns and inform decision-making.\n- Act as the voice of the customer within the organization.\n",
    "similar-to-other-roles": null,
    "skills": "- Proven experience in a senior marketing leadership role.\n- A deep understanding of all aspects of marketing, from brand strategy to digital marketing.\n- Strong strategic thinking, business acumen, and analytical skills.\n- Excellent leadership, communication, and interpersonal skills.\n- A data-driven mindset and a focus on results.\n- A passion for building strong brands and creating great customer experiences.\n"
  },
  {
    "role-name": "Creative Team Manager",
    "description": "A Creative Team Manager is an operational and people leader who is responsible for the day-to-day management of a team of creative professionals. They are the glue that holds the creative team together, ensuring that projects are delivered on time, on budget, and to a high standard of quality. They are master organizers, communicators, and problem-solvers, with a deep understanding of the creative process.\n",
    "industry": "Agency, In-house\n",
    "medium": "Service\n",
    "org-level": "Manager\n",
    "responsibilities": "- Manage the workflow and resources of the creative team, including designers, writers, and other creative professionals.\n- Develop and manage project timelines, budgets, and deliverables.\n- Act as the primary point of contact for clients and internal stakeholders.\n- Facilitate communication and collaboration within the creative team and with other departments.\n- Mentor and develop the skills of the creative team members.\n- Ensure that all creative work is on-brand and meets a high standard of quality.\n- Continuously improve the creative process and workflow.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong project management and organizational skills.\n- Excellent communication, interpersonal, and leadership skills.\n- A deep understanding of the creative process and the needs of creative professionals.\n- Experience with project management software and other tools.\n- Ability to manage multiple projects and priorities in a fast-paced environment.\n- A passion for creativity and a commitment to quality.\n- Experience in a creative role, such as a designer or writer, is often a plus.\n"
  },
  {
    "role-name": "Lead Designer",
    "description": "A Lead Designer is a senior designer who is responsible for the design execution and quality for a specific product, project, or team. They are a hands-on leader who is both a skilled designer and a mentor to other designers. They are responsible for ensuring that the design work is aligned with the project's goals, and for guiding the team to create a high-quality, user-centered experience.\n",
    "industry": "Tech, Agency\n",
    "medium": "Digital\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead the design of a specific product, project, or feature from concept to completion.\n- Provide guidance, feedback, and mentorship to other designers on the team.\n- Collaborate with product managers, engineers, and other stakeholders to ensure a cohesive and user-centered product.\n- Facilitate design critiques and reviews to ensure a high standard of quality.\n- Advocate for the user and for design best practices.\n- Contribute to the development of the design team's culture and processes.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in a variety of design disciplines, such as UX design, product design, or visual design.\n- Strong leadership and mentoring skills.\n- Excellent communication, collaboration, and presentation skills.\n- A passion for creating high-quality, user-centered experiences.\n- A strong portfolio that demonstrates a deep understanding of the design process and a track record of success.\n- Ability to provide and receive constructive feedback.\n"
  },
  {
    "role-name": "Graphic Designer",
    "description": "A Graphic Designer is a creative professional who uses visual communication to convey a message or an idea. They are responsible for creating a wide range of visual assets, from logos and branding to marketing materials and websites. They are masters of visual language, with a deep understanding of typography, color, and composition. They are passionate about creating designs that are both beautiful and effective.\n",
    "industry": "General\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of visual assets, including logos, branding, marketing materials, and websites.\n- Collaborate with clients, art directors, and other stakeholders to understand project goals and requirements.\n- Develop and execute design concepts from initial sketch to final production.\n- Stay current with the latest trends and best practices in graphic design.\n- Prepare files for print and digital production.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in graphic design principles, including typography, color theory, and layout.\n- Proficiency in design software, such as Adobe Creative Suite (Illustrator, Photoshop, InDesign).\n- A strong portfolio that showcases a range of design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for design.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Fashion Designer",
    "description": "A Fashion Designer is a creative professional who designs and develops clothing, footwear, and accessories. They are the visionaries of the fashion world, responsible for creating the trends that we see on the runway and in stores. They are passionate and creative individuals, with a deep understanding of fashion history, garment construction, and the business of fashion.\n",
    "industry": "Fashion\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Research and analyze fashion trends to develop new design concepts.\n- Create sketches and illustrations of clothing, footwear, and accessory designs.\n- Select fabrics, trims, and colors for each design.\n- Create detailed technical packs and specification sheets for manufacturers.\n- Collaborate with pattern makers and sample makers to create prototypes and samples.\n- Participate in fittings and provide feedback to ensure proper fit and construction.\n- Present and promote their collections to buyers and the media.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong sketching and illustration abilities.\n- In-depth knowledge of fabrics, textiles, and garment construction.\n- Proficiency in Adobe Illustrator and Photoshop.\n- Understanding of the product development process from concept to production.\n- Excellent sense of style and color.\n- Strong communication and collaboration skills.\n- A passion for fashion and a creative mindset.\n"
  },
  {
    "role-name": "Content Designer",
    "description": "A Content Designer is a user experience professional who focuses on the content of a product or service. They are responsible for creating clear, concise, and user-focused content that helps people achieve their goals. They are advocates for the user, ensuring that the language and structure of the content is intuitive, accessible, and easy to understand.\n",
    "industry": "Tech, Government\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Write, edit, and structure content for user interfaces, websites, and other digital products.\n- Develop and maintain content strategies, guidelines, and style guides.\n- Collaborate with UX designers, researchers, and product managers to create a cohesive and user-centered experience.\n- Use data and user research to inform content decisions.\n- Conduct content audits and inventories to identify gaps and opportunities for improvement.\n- Champion the importance of clear and accessible language throughout the organization.\n",
    "similar-to-other-roles": null,
    "skills": "- Exceptional writing, editing, and proofreading skills.\n- A deep understanding of user experience (UX) and user-centered design principles.\n- Experience with content strategy and information architecture.\n- Knowledge of accessibility best practices for content.\n- Strong communication and collaboration skills.\n- Ability to translate complex concepts into simple and clear language.\n- A portfolio that demonstrates a strong understanding of UX writing and content design.\n"
  },
  {
    "role-name": "Instructional Designer",
    "description": "An Instructional Designer is a professional who specializes in the design and development of learning experiences. They are experts in how people learn, and they use that knowledge to create effective and engaging training materials, courses, and other educational content. They are passionate about helping people learn and grow, and they are skilled in a variety of design and development tools.\n",
    "industry": "Education, Corporate Training\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and develop a wide range of learning experiences, from e-learning modules and instructor-led training to videos and job aids.\n- Collaborate with subject matter experts to understand the learning needs of the audience.\n- Apply instructional design theories and models to the design of learning experiences.\n- Create engaging and interactive learning content that is tailored to the needs of the learner.\n- Evaluate the effectiveness of learning experiences and make improvements as needed.\n- Stay current with the latest trends and best practices in instructional design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of instructional design theories and models.\n- Expertise in a variety of authoring tools, such as Articulate Storyline, Adobe Captivate, or Camtasia.\n- Strong writing, editing, and communication skills.\n- Excellent project management and organizational skills.\n- A passion for learning and a creative mindset.\n- A portfolio that demonstrates a strong ability to design and develop effective learning experiences.\n"
  },
  {
    "role-name": "Ux Lead",
    "description": "A UX Lead is a senior UX professional who is responsible for the UX design of a specific product, project, or team. They are a hands-on leader who is both a skilled UX designer and a mentor to other designers. They are responsible for ensuring that the UX work is aligned with the project's goals, and for guiding the team to create a high-quality, user-centered experience.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead the UX design of a specific product, project, or feature from concept to completion.\n- Provide guidance, feedback, and mentorship to other UX designers on the team.\n- Collaborate with product managers, engineers, and other stakeholders to ensure a cohesive and user-centered product.\n- Facilitate design critiques and reviews to ensure a high standard of quality.\n- Advocate for the user and for UX best practices.\n- Contribute to the development of the UX team's culture and processes.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in UX design, user research, and interaction design.\n- Strong leadership and mentoring skills.\n- Excellent communication, collaboration, and presentation skills.\n- A passion for creating high-quality, user-centered experiences.\n- A strong portfolio that demonstrates a deep understanding of the UX design process and a track record of success.\n- Ability to provide and receive constructive feedback.\n"
  },
  {
    "role-name": "User Experience Designer",
    "description": "A User Experience (UX) Designer is a human-centered design professional who is responsible for the overall experience of a product, service, or brand. They are strategic and empathetic thinkers who use a variety of design and research methods to understand the needs and motivations of users. They are the architects of the user journey, designing every interaction to be as intuitive, enjoyable, and valuable as possible.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Conduct user research to understand the needs, behaviors, and pain points of users.\n- Create user personas, journey maps, and other design artifacts to communicate user insights.\n- Design and prototype end-to-end experiences that are both user-friendly and aligned with business goals.\n- Collaborate with product managers, engineers, and other stakeholders to bring experience designs to life.\n- Conduct usability testing and gather feedback to iterate on and improve the user experience.\n- Advocate for the user throughout the product development process.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of human-centered design principles and methodologies.\n- Expertise in user research, interaction design, and information architecture.\n- Strong empathy and a passion for understanding the needs of users.\n- Excellent communication, collaboration, and storytelling skills.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe XD.\n- A portfolio that demonstrates a strong understanding of experience design and a commitment to creating great user experiences.\n"
  },
  {
    "role-name": "Digital Designer",
    "description": "A Digital Designer is a creative professional who specializes in designing for digital platforms and media. They are responsible for creating a wide range of visual assets, from websites and mobile apps to social media graphics and online ads. They are masters of the digital canvas, with a deep understanding of how to create designs that are not only beautiful, but also user-friendly and effective.\n",
    "industry": "Agency, Tech, Marketing\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of digital assets, including websites, mobile apps, social media graphics, and online ads.\n- Collaborate with other designers, developers, and marketers to bring digital projects to life.\n- Ensure that all digital designs are on-brand and consistent with the company's visual identity.\n- Stay current with the latest trends and best practices in digital design.\n- Create wireframes, prototypes, and other design artifacts to communicate design concepts.\n- Advocate for the user and for design best practices.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong skills in a variety of digital design disciplines, such as web design, mobile design, or interaction design.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe Creative Suite.\n- A strong portfolio that showcases a range of digital design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A user-centered mindset and a passion for creating great digital experiences.\n"
  },
  {
    "role-name": "Sound Designer",
    "description": "A Sound Designer is a creative professional who is responsible for the design and creation of the sound for a variety of media, including film, television, video games, and theater. They are sonic storytellers who use their artistic and technical skills to create immersive and emotionally resonant soundscapes. They are passionate about using sound to enhance the audience's experience and to bring the story to life.\n",
    "industry": "Gaming, Film, Tech\n",
    "medium": "Sound\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of sound effects, from realistic to fantastical.\n- Record, edit, and mix dialogue and other audio.\n- Create and implement soundscapes and ambiences.\n- Collaborate with the director, composer, and other members of the creative team to develop a vision for the sound design.\n- Stay current with the latest trends and technologies in sound design.\n- Manage the budget and timeline for the sound design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of the principles of sound design.\n- Expertise in a variety of digital audio workstations (DAWs), such as Pro Tools, Logic Pro, or Reaper.\n- Strong artistic and creative skills.\n- Excellent communication and collaboration skills.\n- A passion for sound and a creative mindset.\n- A portfolio that showcases a strong ability to design and execute sound design projects.\n"
  },
  {
    "role-name": "Prompt Engineer",
    "description": "A Prompt Engineer is a creative and analytical professional who specializes in the design and optimization of prompts for generative AI models. They are a hybrid of a writer, a programmer, and a data scientist, with a deep understanding of how to communicate with AI models to get the best possible results. They are passionate about pushing the boundaries of what is possible with generative AI and are constantly experimenting with new and innovative ways to use it.\n",
    "industry": "Tech, AI\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and write effective prompts for a wide range of generative AI models and tasks.\n- A/B test and optimize prompts to improve the quality and relevance of the AI's output.\n- Develop and maintain a library of best practices and reusable prompts.\n- Collaborate with data scientists, engineers, and other stakeholders to integrate generative AI into products and services.\n- Stay current with the latest research and best practices in prompt engineering.\n- Troubleshoot and debug issues with generative AI models.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of how generative AI models work.\n- Expertise in natural language processing (NLP) and machine learning.\n- Strong writing, editing, and communication skills.\n- Excellent analytical and problem-solving skills.\n- A passion for experimentation and a creative mindset.\n- A portfolio that demonstrates a strong ability to use prompt engineering to generate high-quality results.\n"
  },
  {
    "role-name": "Ux Director",
    "description": "A UX Director is a senior leader who is responsible for the overall user experience (UX) vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing UX teams. They are responsible for setting the bar for UX excellence and for ensuring that the UX team is creating products that are both user-friendly and valuable to the business.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the UX vision and strategy for the organization.\n- Lead and mentor a team of UX designers, researchers, and other UX professionals, providing guidance, feedback, and career development.\n- Oversee the UX of all products, ensuring a high standard of quality, consistency, and usability.\n- Collaborate with other leaders in product, engineering, and marketing to ensure a cohesive and integrated user experience.\n- Champion a user-centered design culture throughout the organization.\n- Attract, hire, and retain top UX talent.\n- Stay current with the latest trends and best practices in UX.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in UX design, user research, and interaction design.\n- A compelling portfolio of work that demonstrates a commitment to UX excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing UX teams.\n"
  },
  {
    "role-name": "Communications Designer",
    "description": "A Communications Designer is a visual storyteller who translates complex ideas and messages into clear, compelling, and engaging visual content. They work at the intersection of graphic design, information design, and branding to create a wide range of materials that communicate a company's message to its target audience. They are masters of visual language, using typography, color, imagery, and layout to create a cohesive and impactful brand experience.\n",
    "industry": "Agency, Corporate\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and produce a wide range of communication materials, including presentations, reports, infographics, social media graphics, and marketing collateral.\n- Translate complex data and information into clear and easy-to-understand visualizations.\n- Ensure that all visual communications are on-brand and consistent with the company's visual identity.\n- Collaborate with writers, marketers, and other stakeholders to develop and execute communication strategies.\n- Manage multiple projects from concept to completion, often under tight deadlines.\n- Stay current with design trends and best practices in visual communication.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in graphic design principles, including typography, color theory, and layout.\n- Proficiency in design software such as Adobe Creative Suite (Illustrator, Photoshop, InDesign).\n- Strong information design and data visualization skills.\n- Excellent communication and collaboration skills.\n- Ability to think strategically and translate communication goals into visual design solutions.\n- Strong attention to detail and a passion for creating high-quality work.\n- Experience in creating presentations and other visual storytelling assets.\n"
  },
  {
    "role-name": "Product Designer",
    "description": "A Product Designer is a user-centered design professional who is responsible for the overall user experience of a product. They are a hybrid of a UX designer, a UI designer, and a user researcher, with a deep understanding of how to create products that are both user-friendly and valuable to the business. They are passionate about solving real-world problems and creating products that people love to use.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Lead the design of a product from concept to completion.\n- Conduct user research to understand the needs, behaviors, and pain points of users.\n- Create user personas, journey maps, and other design artifacts to communicate user insights.\n- Design and prototype user interfaces that are both beautiful and easy to use.\n- Collaborate with product managers, engineers, and other stakeholders to bring product designs to life.\n- Conduct usability testing and gather feedback to iterate on and improve the product.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of user-centered design principles and methodologies.\n- Expertise in UX design, UI design, and user research.\n- Strong empathy and a passion for understanding the needs of users.\n- Excellent communication, collaboration, and storytelling skills.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe XD.\n- A portfolio that demonstrates a strong understanding of product design and a commitment to creating great user experiences.\n"
  },
  {
    "role-name": "Ux Specialist",
    "description": "A UX Specialist is a user experience professional who has deep expertise in a particular area of UX, such as usability testing, information architecture, or accessibility. They are a go-to expert for their area of specialization, and they use their knowledge to help teams create better user experiences. They are passionate about their area of expertise and are always looking for new and innovative ways to apply it.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Provide expert guidance and support to teams on their area of specialization.\n- Conduct in-depth research and analysis in their area of specialization.\n- Develop and maintain best practices and guidelines for their area of specialization.\n- Stay current with the latest trends and research in their area of specialization.\n- Advocate for the importance of their area of specialization throughout the organization.\n- Mentor and train other designers and researchers in their area of specialization.\n",
    "similar-to-other-roles": null,
    "skills": "- Deep expertise in a particular area of UX, such as usability testing, information architecture, or accessibility.\n- Strong analytical and problem-solving skills.\n- Excellent communication and collaboration skills.\n- A passion for their area of expertise and a desire to share their knowledge with others.\n- A portfolio that demonstrates a deep understanding of their area of specialization.\n- Experience with a variety of specialized tools and technologies.\n"
  },
  {
    "role-name": "Design Technologist",
    "description": "A Design Technologist is a creative professional who is passionate about the intersection of design and technology. They are a designer who can code, and a developer who has a deep understanding of design. They are responsible for exploring and prototyping new ideas, pushing the boundaries of what is possible with technology. They are a bridge between the design and engineering teams, helping to ensure that the final product is both innovative and technically feasible.\n",
    "industry": "Tech, Agency\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Explore and experiment with new and emerging technologies, such as AR/VR, AI, and creative coding.\n- Build functional prototypes to demonstrate and validate new design concepts.\n- Collaborate with designers and engineers to bring innovative ideas to life.\n- Provide technical guidance and support to the design team.\n- Contribute to the development of design systems and other tools to improve the design process.\n- Stay current with the latest trends and best practices in design and technology.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong creative and design thinking skills.\n- Proficiency in a variety of programming languages and frameworks, such as JavaScript, Python, and React.\n- Experience with creative coding tools and libraries, such as Processing, openFrameworks, or p5.js.\n- A passion for prototyping and experimentation.\n- Excellent problem-solving and collaboration skills.\n- A portfolio that showcases a strong ability to use technology to create innovative and engaging experiences.\n"
  },
  {
    "role-name": "Designops Specialist",
    "description": "A DesignOps Specialist is a hands-on professional who is responsible for supporting the operational needs of a design team. They are the engine that keeps the design team running smoothly, responsible for a wide range of tasks, from managing tools and systems to coordinating events and onboarding new team members. They are master organizers, problem-solvers, and collaborators, with a passion for making design teams more efficient and effective.\n",
    "industry": "Tech\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Manage the design team's tools and systems, including licenses, subscriptions, and integrations.\n- Coordinate the onboarding of new design team members.\n- Organize team meetings, workshops, and other events.\n- Document the design team's processes and workflows.\n- Assist with the management of the design team's budget and resources.\n- Support the design team with a variety of administrative and operational tasks.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong organizational and project management skills.\n- Excellent communication and interpersonal skills.\n- Experience with a variety of design tools and technologies.\n- A passion for making design teams more efficient and effective.\n- A proactive and problem-solving mindset.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Behavioural Designer",
    "description": "A Behavioural Designer applies principles from psychology, behavioral economics, and cognitive science to design products, services, and experiences that influence human behavior in a positive and predictable way. They seek to understand the motivations, biases, and decision-making processes of users to create solutions that help people achieve their goals.\n",
    "industry": "Tech, Health, Finance\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Conduct user research to understand the psychological and behavioral drivers of user actions.\n- Apply behavioral science frameworks (e.g., COM-B, Fogg Behavior Model) to analyze and map user behaviors.\n- Design and prototype interventions, such as nudges, feedback loops, and incentives, to encourage desired behaviors.\n- Plan and execute experiments, including A/B tests and randomized controlled trials, to measure the impact of design interventions.\n- Collaborate with product managers, UX designers, and data scientists to integrate behavioral insights into the product development process.\n- Communicate findings and recommendations to stakeholders in a clear and compelling way.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong understanding of behavioral science principles and frameworks.\n- Proficiency in qualitative and quantitative research methods.\n- Experience with experimental design and A/B testing.\n- Strong analytical and critical thinking skills.\n- Familiarity with UX design and product development processes.\n- Excellent communication and storytelling abilities.\n- A passion for understanding human behavior and creating positive change.\n"
  },
  {
    "role-name": "Chief Innovation Officer (Cio)",
    "description": "A Chief Innovation Officer (CIO) is a senior executive responsible for fostering a culture of innovation and driving the development of new products, services, and business models. They are tasked with managing the process of innovation, from ideation and experimentation to implementation and scaling. The CIO is a catalyst for change and a champion of new ideas.\n",
    "industry": "Enterprise, Consulting\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and lead the company's innovation strategy and portfolio.\n- Foster a culture that encourages creativity, experimentation, and risk-taking.\n- Establish and manage an innovation pipeline, from sourcing ideas to launching new ventures.\n- Identify and explore emerging technologies, trends, and business models.\n- Build and maintain relationships with external partners, such as startups, universities, and research labs.\n- Lead and mentor a team of innovation professionals.\n- Secure funding and resources for innovation projects.\n",
    "similar-to-other-roles": null,
    "skills": "- Proven experience in innovation management, corporate venturing, or a related field.\n- Strong strategic thinking and business acumen.\n- A deep understanding of innovation methodologies, such as design thinking, lean startup, and open innovation.\n- Excellent leadership, communication, and influencing skills.\n- A passion for exploring new ideas and challenging the status quo.\n- Ability to thrive in a fast-paced, ambiguous, and dynamic environment.\n"
  },
  {
    "role-name": "User Researcher",
    "description": "A User Researcher is a user experience professional who specializes in the understanding of user behaviors, needs, and motivations. They are the voice of the user in the product development process, and they use a variety of qualitative and quantitative research methods to generate insights that inform the design of products, services, and experiences. They are empathetic and analytical thinkers, with a passion for understanding people.\n",
    "industry": "Tech\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Plan and conduct a wide range of user research studies, including interviews, surveys, usability tests, and ethnographic research.\n- Analyze and synthesize research findings to generate actionable insights.\n- Communicate research insights to designers, product managers, engineers, and other stakeholders in a clear and compelling way.\n- Create user personas, journey maps, and other research artifacts to help the team build empathy for users.\n- Advocate for the user throughout the product development process.\n- Stay current with the latest trends and best practices in user research.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in a variety of qualitative and quantitative research methods.\n- Strong analytical and synthesis skills.\n- Excellent communication, collaboration, and storytelling skills.\n- A deep sense of empathy and a passion for understanding people.\n- A portfolio that demonstrates a strong ability to generate and communicate user insights.\n- Experience with a variety of research tools and technologies.\n"
  },
  {
    "role-name": "Framsynsdesigner (Foresight Designer)",
    "description": "A Foresight Designer is a strategic designer who uses design methods to explore, visualize, and shape the future. They are experts in understanding and interpreting the trends and signals that are shaping the future, and in using that understanding to create new products, services, and experiences. They are futurists and storytellers, with a passion for creating a better future.\n",
    "industry": "Consulting, Public Sector\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Scan the horizon for emerging trends, technologies, and social changes.\n- Develop and visualize future scenarios and speculative designs.\n- Facilitate workshops and collaborative sessions to explore the future with clients and stakeholders.\n- Create and use a variety of foresight tools and methods, such as trend analysis, scenario planning, and speculative design.\n- Translate future insights into actionable strategies and opportunities for innovation.\n- Communicate and evangelize a future-oriented mindset within the organization.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in strategic foresight, speculative design, and other future-oriented design methods.\n- Strong research, analysis, and synthesis skills.\n- Excellent communication, facilitation, and storytelling skills.\n- A passion for exploring the future and a creative mindset.\n- A portfolio that demonstrates a strong ability to think critically and creatively about the future.\n- Ability to navigate ambiguity and uncertainty.\n"
  },
  {
    "role-name": "Director Of Research",
    "description": "A Director of Research is a senior leader who is responsible for the overall research vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing research teams. They are responsible for setting the bar for research excellence and for ensuring that the research team is generating insights that inform and inspire the design of products, services, and experiences.\n",
    "industry": "Tech, Consulting\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the research vision and strategy for the organization.\n- Lead and mentor a team of researchers, providing guidance, feedback, and career development.\n- Oversee all research activities, ensuring a high standard of quality and rigor.\n- Collaborate with other leaders in design, product, and engineering to ensure that research is integrated into the entire product development process.\n- Champion a user-centered and data-informed culture throughout the organization.\n- Attract, hire, and retain top research talent.\n- Stay current with the latest trends and best practices in user research.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in a wide range of qualitative and quantitative research methods.\n- A compelling track record of generating and communicating user insights that have had a significant impact on product and business decisions.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing research teams.\n"
  },
  {
    "role-name": "Innovation Lead",
    "description": "An Innovation Lead is a senior professional who is responsible for leading and guiding a team of innovators. They are a player-coach who is both a skilled innovation practitioner and a mentor to others. They are responsible for setting the vision and direction for the innovation team, and for ensuring that the team is delivering high-quality work that drives business growth.\n",
    "industry": "Enterprise, Tech\n",
    "medium": "Service\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead and mentor a team of innovators, providing guidance, feedback, and career development.\n- Develop and implement an innovation strategy that is aligned with the company's business goals.\n- Oversee the execution of innovation projects from concept to completion.\n- Champion a culture of innovation throughout the organization.\n- Collaborate with other teams to ensure that innovation is integrated into the entire product development process.\n- Establish and track key innovation metrics to measure the success of the team's work.\n- Stay current with the latest trends and best practices in innovation.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Expertise in innovation methodologies, such as design thinking, lean startup, and open innovation.\n- Excellent communication, presentation, and facilitation skills.\n- A data-driven mindset and a focus on results.\n- A passion for building and mentoring high-performing teams.\n- A strong track record of success in leading innovation projects.\n"
  },
  {
    "role-name": "Ai Prompt Designer",
    "description": "An AI Prompt Designer, also known as a Prompt Engineer, is a creative and analytical role focused on crafting high-quality inputs (prompts) for generative AI models to produce desired outputs. They act as a bridge between human intent and the AI's capabilities, meticulously designing and refining prompts to generate text, images, or code that is accurate, coherent, and contextually appropriate.\n",
    "industry": "Tech, Creative Agency\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design, write, and iterate on prompts for large language models (LLMs) and other generative AI systems.\n- Develop and maintain a library of effective prompts for various use cases and scenarios.\n- Analyze and evaluate the performance of different prompts and model responses.\n- Collaborate with content creators, developers, and product managers to understand their needs and provide prompt engineering expertise.\n- Stay abreast of the latest advancements in generative AI and prompt engineering techniques.\n- Test for and mitigate potential biases and undesirable outputs from AI models.\n",
    "similar-to-other-roles": null,
    "skills": "- Deep understanding of the capabilities and limitations of large language models (LLMs).\n- Exceptional writing, editing, and communication skills.\n- A logical and analytical mindset for systematic testing and refinement of prompts.\n- Creativity and the ability to think outside the box to achieve desired AI outputs.\n- Familiarity with different generative AI models and platforms.\n- Basic understanding of programming concepts can be beneficial.\n"
  },
  {
    "role-name": "Designer",
    "description": "A Designer is a creative professional who is responsible for the visual and functional aspects of a product, service, or experience. They are problem-solvers who use their skills in a variety of design disciplines to create solutions that are both beautiful and effective. They are empathetic and user-centered, with a passion for creating experiences that are both enjoyable and easy to use.\n",
    "industry": "General\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Create and execute designs for a variety of projects, from websites and mobile apps to branding and marketing materials.\n- Collaborate with other designers, product managers, engineers, and other stakeholders to bring designs to life.\n- Conduct user research and usability testing to inform design decisions.\n- Create wireframes, prototypes, and other design artifacts to communicate design concepts.\n- Stay current with the latest trends and best practices in design.\n- Advocate for the user and for design best practices.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong skills in a variety of design disciplines, such as UX design, visual design, or interaction design.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe Creative Suite.\n- A strong portfolio that showcases a range of design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A user-centered mindset and a passion for creating great experiences.\n"
  },
  {
    "role-name": "Information Architect (Ia)",
    "description": "An Information Architect (IA) is a user experience professional who specializes in organizing, structuring, and labeling content in a way that is easy to find and understand. They are the architects of the information space, creating the blueprints for websites, applications, and other digital products. They are passionate about bringing order to chaos and creating a seamless and intuitive experience for users.\n",
    "industry": "Tech, Library\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Analyze user needs and behaviors to understand how they look for and use information.\n- Design and create information architectures, including sitemaps, navigation systems, and taxonomies.\n- Conduct card sorting, tree testing, and other user research methods to validate information architectures.\n- Collaborate with UX designers, content strategists, and other stakeholders to create a cohesive and user-centered experience.\n- Stay current with the latest trends and best practices in information architecture.\n- Advocate for a clear and consistent information architecture across all digital products.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in information architecture principles and best practices.\n- A deep understanding of user-centered design and user research.\n- Strong analytical and systems thinking skills.\n- Excellent communication and collaboration skills.\n- Experience with a variety of IA tools and methods, such as card sorting, tree testing, and sitemapping.\n- A portfolio that demonstrates a strong ability to organize and structure complex information.\n"
  },
  {
    "role-name": "3D Artist",
    "description": "A 3D Artist is a digital artist who creates three-dimensional models, animations, and visual effects for a wide range of applications, including video games, films, television, virtual reality, and advertising. They are responsible for bringing characters, environments, and objects to life in a 3D space, ensuring they are visually appealing, technically sound, and aligned with the project's artistic vision.\n",
    "industry": "Gaming, Entertainment, Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Conceptualize and create high-polygon and low-polygon 3D models of characters, props, and environments.\n- Create detailed textures and materials for 3D models, including UV mapping and shader setup.\n- Implement lighting and rendering setups to create compelling visual scenes.\n- Animate characters and objects to create dynamic and believable motion.\n- Collaborate with art directors, designers, and engineers to ensure assets meet project requirements.\n- Optimize 3D assets for real-time rendering and performance on various platforms.\n- Rig characters and objects for animation.\n- Stay current with industry trends, tools, and technologies in 3D art.\n",
    "similar-to-other-roles": null,
    "skills": "- Proficiency in 3D modeling software such as Maya, 3ds Max, Blender, or ZBrush.\n- Strong understanding of texturing and material creation using tools like Substance Painter and Photoshop.\n- Knowledge of lighting, shading, and rendering techniques.\n- Experience with game engines like Unreal Engine or Unity.\n- Strong foundation in art fundamentals, including anatomy, composition, and color theory.\n- Excellent problem-solving and communication skills.\n- Ability to work effectively in a collaborative team environment.\n"
  },
  {
    "role-name": "Design Operations Lead",
    "description": "A Design Operations Lead is a strategic and operational leader who is responsible for the efficiency and effectiveness of a design organization. They are the backbone of the design team, responsible for creating the systems, processes, and tools that enable designers to do their best work. They are master organizers, problem-solvers, and collaborators, with a passion for making design teams more productive and impactful.\n",
    "industry": "Tech, Enterprise\n",
    "medium": "Service\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Design and implement the operational strategy for the design organization.\n- Optimize the design team's workflows and processes.\n- Manage the design team's tools, systems, and budget.\n- Develop and manage programs to support the design team, such as onboarding, training, and career development.\n- Measure and track the impact of the design team's work.\n- Foster a strong and healthy design culture.\n- Act as a bridge between the design team and other departments.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong operational and project management skills.\n- A deep understanding of the design process and the needs of design teams.\n- Excellent communication, collaboration, and influencing skills.\n- A data-driven mindset and a focus on continuous improvement.\n- Experience with a variety of design tools and technologies.\n- A passion for making design teams more effective and efficient.\n"
  },
  {
    "role-name": "Transformation Leader",
    "description": "A Transformation Leader is a senior leader who is responsible for the overall transformation vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing transformation teams. They are responsible for setting the bar for transformation excellence and for ensuring that the transformation team is creating a more agile, innovative, and customer-centric organization.\n",
    "industry": "Enterprise\n",
    "medium": "Service\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Develop and articulate the transformation vision and strategy for the organization.\n- Lead and mentor a team of transformation specialists, providing guidance, feedback, and career development.\n- Oversee the execution of all transformation initiatives, ensuring a high standard of quality and consistency.\n- Collaborate with other leaders to ensure a cohesive and integrated transformation.\n- Champion a culture of transformation throughout the organization.\n- Attract, hire, and retain top transformation talent.\n- Stay current with the latest trends and best practices in transformation.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in transformation methodologies, such as change management, business process reengineering, and organizational design.\n- A compelling track record of success in leading large-scale transformation initiatives.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing transformation teams.\n"
  },
  {
    "role-name": "Director Of Innovation",
    "description": "A Director of Innovation is a senior leader who is responsible for fostering a culture of innovation and driving the development of new products, services, and business models. They are tasked with managing the process of innovation, from ideation and experimentation to implementation and scaling. The Director of Innovation is a catalyst for change and a champion of new ideas.\n",
    "industry": "Enterprise, Consulting\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and lead the company's innovation strategy and portfolio.\n- Foster a culture that encourages creativity, experimentation, and risk-taking.\n- Establish and manage an innovation pipeline, from sourcing ideas to launching new ventures.\n- Identify and explore emerging technologies, trends, and business models.\n- Build and maintain relationships with external partners, such as startups, universities, and research labs.\n- Lead and mentor a team of innovation professionals.\n- Secure funding and resources for innovation projects.\n",
    "similar-to-other-roles": null,
    "skills": "- Proven experience in innovation management, corporate venturing, or a related field.\n- Strong strategic thinking and business acumen.\n- A deep understanding of innovation methodologies, such as design thinking, lean startup, and open innovation.\n- Excellent leadership, communication, and influencing skills.\n- A passion for exploring new ideas and challenging the status quo.\n- Ability to thrive in a fast-paced, ambiguous, and dynamic environment.\n"
  },
  {
    "role-name": "Cmf Designer",
    "description": "A CMF (Color, Material, Finish) Designer is a specialist who focuses on the aesthetic and tactile qualities of a product. They are responsible for selecting and defining the colors, materials, and finishes that are applied to a product's surface. CMF Designers play a crucial role in creating a product's personality, perceived quality, and emotional appeal.\n",
    "industry": "Automotive, Consumer Electronics\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Research and analyze trends in color, materials, and finishes.\n- Develop CMF strategies and concepts that align with the brand and product vision.\n- Create mood boards, material samples, and other visual tools to communicate CMF direction.\n- Work closely with industrial designers and engineers to ensure CMF specifications are achievable and meet quality standards.\n- Collaborate with suppliers to source and develop new materials and finishes.\n- Create detailed CMF documentation and specifications for manufacturing.\n",
    "similar-to-other-roles": null,
    "skills": "- A keen eye for color, texture, and detail.\n- Strong understanding of materials, manufacturing processes, and finishing techniques.\n- Ability to forecast and translate trends into compelling CMF strategies.\n- Proficiency in 2D and 3D design software (e.g., Adobe Creative Suite, KeyShot).\n- Excellent communication and presentation skills.\n- A strong portfolio showcasing a deep understanding of CMF design.\n- Meticulous attention to detail and a passion for quality.\n"
  },
  {
    "role-name": "Designops Lead",
    "description": "A DesignOps Lead is a strategic and operational leader who is responsible for the efficiency and effectiveness of a design organization. They are the backbone of the design team, responsible for creating the systems, processes, and tools that enable designers to do their best work. They are master organizers, problem-solvers, and collaborators, with a passion for making design teams more productive and impactful.\n",
    "industry": "Tech, Enterprise\n",
    "medium": "Service\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Design and implement the operational strategy for the design organization.\n- Optimize the design team's workflows and processes.\n- Manage the design team's tools, systems, and budget.\n- Develop and manage programs to support the design team, such as onboarding, training, and career development.\n- Measure and track the impact of the design team's work.\n- Foster a strong and healthy design culture.\n- Act as a bridge between the design team and other departments.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong operational and project management skills.\n- A deep understanding of the design process and the needs of design teams.\n- Excellent communication, collaboration, and influencing skills.\n- A data-driven mindset and a focus on continuous improvement.\n- Experience with a variety of design tools and technologies.\n- A passion for making design teams more effective and efficient.\n"
  },
  {
    "role-name": "Creative Technologist",
    "description": "A Creative Technologist is a hybrid professional who bridges the gap between creativity and technology. They are part designer, part developer, and part strategist, with a passion for using emerging technologies to create innovative and engaging experiences. They are master prototypers, experimenters, and problem-solvers, who are comfortable working in a fast-paced and ambiguous environment.\n",
    "industry": "Agency, Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Explore and experiment with new and emerging technologies, such as AR/VR, AI, and physical computing.\n- Rapidly prototype and build interactive experiences to demonstrate the potential of new ideas.\n- Collaborate with designers, developers, and strategists to bring creative concepts to life.\n- Develop and build interactive installations, prototypes, and other creative technology projects.\n- Act as a bridge between the design and engineering teams, translating creative ideas into technical requirements.\n- Inspire and educate others about the possibilities of creative technology.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong creative and design thinking skills.\n- Proficiency in creative coding frameworks and languages, such as JavaScript, Python, Processing, or openFrameworks.\n- Experience with emerging technologies, such as AR/VR, AI, and physical computing.\n- A passion for prototyping and experimentation.\n- Excellent problem-solving and collaboration skills.\n- A portfolio that showcases a strong understanding of creative technology and a passion for innovation.\n"
  },
  {
    "role-name": "Marketing Designer",
    "description": "A Marketing Designer is a creative professional who specializes in designing visual assets for marketing and advertising campaigns. They are responsible for creating a wide range of materials, from social media graphics and email newsletters to landing pages and print ads. They are masters of visual communication, with a deep understanding of how to use design to attract, engage, and convert customers.\n",
    "industry": "Marketing, Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of marketing assets, including social media graphics, email newsletters, landing pages, and print ads.\n- Collaborate with marketers, copywriters, and other stakeholders to develop and execute marketing campaigns.\n- Ensure that all marketing materials are on-brand and consistent with the company's visual identity.\n- Stay current with the latest trends and best practices in marketing design.\n- A/B test and optimize marketing designs to improve performance.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in graphic design principles, including typography, color theory, and layout.\n- Proficiency in design software, such as Adobe Creative Suite (Illustrator, Photoshop, InDesign).\n- A strong portfolio that showcases a range of marketing design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A data-driven mindset and a focus on results.\n- A creative mindset and a passion for marketing.\n"
  },
  {
    "role-name": "Design Researcher",
    "description": "A Design Researcher is a user-centered research professional who is responsible for understanding the needs, behaviors, and motivations of users. They are the voice of the user in the design process, using a variety of qualitative and quantitative research methods to generate insights that inform the design of products, services, and experiences. They are empathetic and analytical thinkers, with a passion for understanding people.\n",
    "industry": "Tech, Consulting\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Plan and conduct a wide range of user research studies, including interviews, surveys, usability tests, and ethnographic research.\n- Analyze and synthesize research findings to generate actionable insights.\n- Communicate research insights to designers, product managers, engineers, and other stakeholders in a clear and compelling way.\n- Create user personas, journey maps, and other research artifacts to help the team build empathy for users.\n- Advocate for the user throughout the product development process.\n- Stay current with the latest trends and best practices in user research.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in a variety of qualitative and quantitative research methods.\n- Strong analytical and synthesis skills.\n- Excellent communication, collaboration, and storytelling skills.\n- A deep sense of empathy and a passion for understanding people.\n- A portfolio that demonstrates a strong ability to generate and communicate user insights.\n- Experience with a variety of research tools and technologies.\n"
  },
  {
    "role-name": "Ux Ui Lead",
    "description": "A UX/UI Lead is a senior design professional who is responsible for the UX and UI design of a specific product, project, or team. They are a hands-on leader who is both a skilled UX/UI designer and a mentor to other designers. They are responsible for ensuring that the UX/UI work is aligned with the project's goals, and for guiding the team to create a high-quality, user-centered experience.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead the UX/UI design of a specific product, project, or feature from concept to completion.\n- Provide guidance, feedback, and mentorship to other UX/UI designers on the team.\n- Collaborate with product managers, engineers, and other stakeholders to ensure a cohesive and user-centered product.\n- Facilitate design critiques and reviews to ensure a high standard of quality.\n- Advocate for the user and for UX/UI best practices.\n- Contribute to the development of the UX/UI team's culture and processes.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in UX and UI design, as well as in user research and interaction design.\n- Strong leadership and mentoring skills.\n- Excellent communication, collaboration, and presentation skills.\n- A passion for creating high-quality, user-centered experiences.\n- A strong portfolio that demonstrates a deep understanding of the UX/UI design process and a track record of success.\n- Ability to provide and receive constructive feedback.\n"
  },
  {
    "role-name": "Level Designer",
    "description": "A Level Designer is a game designer who specializes in the design and creation of the levels, missions, and environments in a video game. They are the architects of the player's journey, responsible for creating engaging and challenging experiences that are both fun and fair. They are passionate about creating immersive and memorable worlds for players to explore.\n",
    "industry": "Gaming\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create the layout, flow, and pacing of game levels.\n- Place and script enemies, items, and other interactive elements.\n- Balance the difficulty and challenge of levels to create a compelling player experience.\n- Collaborate with artists, programmers, and other team members to bring levels to life.\n- Playtest and provide feedback on levels to ensure a high-quality player experience.\n- Stay current with the latest trends and best practices in level design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of level design principles and best practices.\n- Experience with a variety of level editing tools and game engines.\n- Strong analytical and problem-solving skills.\n- Excellent communication and collaboration skills.\n- A passion for playing and making games.\n- A portfolio that demonstrates a strong understanding of level design and a creative mindset.\n"
  },
  {
    "role-name": "Innovation Designer",
    "description": "An Innovation Designer is a creative and strategic thinker who uses design to imagine and create new products, services, and business models. They are experts in the fuzzy front end of the innovation process, from identifying unmet needs and opportunities to prototyping and testing new concepts. They are passionate about creating a better future and are comfortable working in a fast-paced and ambiguous environment.\n",
    "industry": "Consulting, Enterprise\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Lead and facilitate the innovation process, from research and insights to concept development and prototyping.\n- Conduct user research, market analysis, and trend forecasting to identify opportunities for innovation.\n- Develop and visualize new product, service, and business model concepts.\n- Create and test prototypes to validate and iterate on new ideas.\n- Collaborate with cross-functional teams to bring new concepts to life.\n- Communicate and evangelize a culture of innovation within the organization.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in design thinking, service design, and other innovation methodologies.\n- Strong research, analysis, and synthesis skills.\n- Excellent communication, facilitation, and storytelling skills.\n- A passion for innovation and a creative mindset.\n- A portfolio that demonstrates a strong ability to think critically and creatively about the future.\n- Ability to navigate ambiguity and uncertainty.\n"
  },
  {
    "role-name": "Xr Designer",
    "description": "An XR Designer is a creative professional who specializes in the design of extended reality (XR) experiences, including virtual reality (VR), augmented reality (AR), and mixed reality (MR). They are responsible for creating immersive and interactive experiences that blend the physical and digital worlds. They are masters of the spatial realm, with a deep understanding of 3D design, interaction design, and the psychology of presence. They are passionate about creating XR experiences that are not only beautiful, but also believable and engaging.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of XR experiences, from games and simulations to training and social applications.\n- Collaborate with artists, programmers, and other team members to bring XR worlds to life.\n- Develop and execute XR design concepts from initial sketch to final implementation.\n- Stay current with the latest trends and techniques in XR design.\n- Prepare and present design concepts to clients and internal stakeholders.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of XR design, including immersion, presence, and interaction.\n- Proficiency in 3D modeling and game engines, such as Unity or Unreal Engine.\n- A strong portfolio that showcases a range of XR design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for XR.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Design Leader",
    "description": "A Design Leader is a senior design professional who is responsible for the overall design strategy, vision, and culture for an organization. They are a visionary and an advocate for design, with a passion for building and leading high-performing design teams. They are responsible for ensuring that design has a seat at the table and for using design to drive business success.\n",
    "industry": "Tech, Enterprise\n",
    "medium": "Service\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Develop and champion a clear and compelling design vision and strategy for the organization.\n- Build and lead a high-performing design team, including designers, researchers, and other design professionals.\n- Foster a strong and healthy design culture that values creativity, collaboration, and user-centricity.\n- Advocate for the value of design to senior leadership and other stakeholders.\n- Align the design strategy with the overall business strategy.\n- Drive continuous improvement in the design team's processes and practices.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and vision-setting skills.\n- Deep expertise in design, business, and technology.\n- Excellent communication, storytelling, and influencing skills.\n- A passion for building and mentoring high-performing teams.\n- A proven track record of using design to drive business results.\n- Experience in a senior design leadership role.\n"
  },
  {
    "role-name": "Retail Designer",
    "description": "A Retail Designer is a creative professional who specializes in the design of retail store environments. They are responsible for creating experiences that are not only visually appealing, but also functional, on-brand, and drive sales. They are masters of the physical space, with a deep understanding of consumer behavior, visual merchandising, and the business of retail.\n",
    "industry": "Retail, Architecture\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of retail environments, from flagship stores to pop-up shops.\n- Collaborate with clients, marketers, and other stakeholders to understand the brand and the target customer.\n- Develop and execute retail design concepts from initial sketch to final installation.\n- Stay current with the latest trends and best practices in retail design.\n- Prepare and present design concepts to clients and internal stakeholders.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in retail design principles, including store layout, visual merchandising, and lighting.\n- Proficiency in design software, such as AutoCAD, SketchUp, and Adobe Creative Suite.\n- A strong portfolio that showcases a range of retail design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for retail.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Design Strategist",
    "description": "A Design Strategist is a hybrid professional who combines design thinking with business strategy to solve complex challenges and drive innovation. They work at the intersection of design, business, and technology, using a human-centered approach to identify new opportunities and create a clear and actionable path forward. They are big-picture thinkers who are skilled at both divergent and convergent thinking.\n",
    "industry": "Consulting, Innovation\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Lead and facilitate the strategic design process, from research and insights to strategy and execution.\n- Conduct market research, competitive analysis, and user research to identify opportunities for innovation.\n- Develop and articulate a clear and compelling strategic vision for new products, services, and experiences.\n- Create strategic roadmaps, business cases, and other deliverables to communicate the strategy to stakeholders.\n- Facilitate workshops and collaborative sessions with cross-functional teams and senior leadership.\n- Act as a bridge between the design team and the business, ensuring that design is aligned with the company's strategic goals.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in design thinking, service design, and other strategic design methodologies.\n- Strong business acumen and a deep understanding of business strategy.\n- Excellent analytical, critical thinking, and problem-solving skills.\n- Strong communication, facilitation, and storytelling skills.\n- A passion for innovation and a creative mindset.\n- A portfolio that demonstrates a strong ability to use design to solve complex business challenges.\n"
  },
  {
    "role-name": "Chief Experience Officer (Cxo)",
    "description": "A Chief Experience Officer (CXO) is a senior executive who is responsible for the entire customer experience journey. They are tasked with creating a seamless, consistent, and positive experience for customers across all touchpoints, from marketing and sales to product and support. The CXO is the ultimate advocate for the customer within the organization.\n",
    "industry": "Tech, Retail, Service\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and implement a holistic customer experience strategy.\n- Map the end-to-end customer journey and identify key moments of truth and pain points.\n- Champion a customer-centric culture throughout the organization.\n- Collaborate with leaders across all departments to ensure a cohesive and consistent customer experience.\n- Establish and track key customer experience metrics (e.g., NPS, CSAT, customer churn).\n- Use customer feedback and data to drive continuous improvement and innovation.\n- Lead and mentor a team of customer experience professionals.\n",
    "similar-to-other-roles": null,
    "skills": "- Deep expertise in customer experience, service design, and user research.\n- Strong leadership, communication, and influencing skills.\n- A passion for understanding and serving the needs of customers.\n- Strong analytical skills and the ability to use data to drive decisions.\n- Experience in leading cross-functional teams and driving organizational change.\n- A proven track record of improving customer satisfaction and loyalty.\n"
  },
  {
    "role-name": "Staff Designer",
    "description": "A Staff Designer is a senior individual contributor who is a recognized expert in their field. They are a visionary and a mentor, with a passion for solving the most complex and challenging design problems. They are responsible for setting the bar for design excellence and for driving innovation across the organization. They are a force multiplier, who makes everyone around them better.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Lead the design of the most complex and strategic projects.\n- Provide guidance, feedback, and mentorship to other designers.\n- Collaborate with senior leaders in product, engineering, and other departments to shape the direction of the product.\n- Drive the development of the design team's culture, processes, and craft.\n- Stay current with the latest trends and best practices in design and technology.\n- Represent the company at conferences and other industry events.\n",
    "similar-to-other-roles": null,
    "skills": "- Deep expertise in a variety of design disciplines, such as UX design, product design, or systems design.\n- A compelling portfolio of work that demonstrates a commitment to design excellence and innovation.\n- Excellent communication, collaboration, and influencing skills.\n- A passion for solving complex problems and a creative mindset.\n- A strong track record of success in leading large and complex design projects.\n- Ability to provide and receive constructive feedback.\n"
  },
  {
    "role-name": "Design Director",
    "description": "A Design Director is a senior creative leader who is responsible for the overall design vision and execution for a company, a product, or a portfolio of projects. They are a visionary and a mentor, with a passion for building and leading high-performing design teams. They are responsible for setting the bar for design excellence and for ensuring that the design team is creating work that is both beautiful and effective.\n",
    "industry": "Agency, Tech\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the design vision and strategy for the organization.\n- Lead and mentor a team of designers, providing guidance, feedback, and career development.\n- Oversee the design of all products, services, and experiences, ensuring a high standard of quality and consistency.\n- Collaborate with product, engineering, and other teams to ensure that design is integrated into the entire product development process.\n- Champion a user-centered design culture throughout the organization.\n- Attract, hire, and retain top design talent.\n- Stay current with the latest trends and best practices in design.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- A deep expertise in a variety of design disciplines, such as UX design, product design, or brand design.\n- A compelling portfolio of work that demonstrates a commitment to design excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing design teams.\n"
  },
  {
    "role-name": "Art Director",
    "description": "An Art Director is a creative leader who is responsible for the overall visual style and direction of a project. They work across a variety of industries, including advertising, marketing, publishing, film, and video games, to create a cohesive and compelling visual identity. They are visionaries who guide a team of designers to bring ideas to life.\n",
    "industry": "Agency, Marketing, Entertainment\n",
    "medium": "Digital\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and execute the visual concept and style for projects, from initial mood boards to final execution.\n- Lead and mentor a team of designers, illustrators, and photographers.\n- Collaborate with clients, marketing teams, and other stakeholders to understand project goals and requirements.\n- Oversee the creation of all visual assets, ensuring they are on-brand and meet a high standard of quality.\n- Manage project timelines, budgets, and resources for the creative team.\n- Present creative concepts and strategies to clients and internal stakeholders.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong artistic and creative vision.\n- Excellent leadership and team management abilities.\n- Proficiency in design software such as Adobe Creative Suite.\n- Strong communication, presentation, and interpersonal skills.\n- A deep understanding of branding, typography, and visual storytelling.\n- Ability to think strategically and translate business goals into creative solutions.\n- Experience in managing creative projects from concept to completion.\n"
  },
  {
    "role-name": "Character Designer",
    "description": "A Character Designer is a specialized artist who brings characters to life through visual design. They are responsible for creating the appearance, personality, and style of characters for a variety of media, including animation, video games, comic books, and toys. They are storytellers who use their artistic skills to create memorable and believable characters.\n",
    "industry": "Gaming, Animation\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Develop character concepts and ideas based on scripts, briefs, and art direction.\n- Create detailed character designs, including turnarounds, expression sheets, and costume designs.\n- Explore different visual styles and techniques to find the right look for each character.\n- Collaborate with writers, animators, and modelers to ensure characters are designed for their intended purpose.\n- Iterate on designs based on feedback from the creative team.\n- Research and gather reference materials to inform character designs.\n",
    "similar-to-other-roles": null,
    "skills": "- Exceptional drawing and illustration skills.\n- Strong understanding of anatomy, gesture, and form.\n- Ability to convey personality and emotion through character design.\n- Proficiency in digital art software such as Photoshop, Procreate, or Clip Studio Paint.\n- Creativity and a strong imagination.\n- Excellent communication and collaboration skills.\n- A portfolio showcasing a strong sense of character and personality in your work.\n"
  },
  {
    "role-name": "Ux Designer",
    "description": "A UX (User Experience) Designer is a human-centered design professional who is responsible for the overall experience of a product, service, or brand. They are strategic and empathetic thinkers who use a variety of design and research methods to understand the needs and motivations of users. They are the architects of the user journey, designing every interaction to be as intuitive, enjoyable, and valuable as possible.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Conduct user research to understand the needs, behaviors, and pain points of users.\n- Create user personas, journey maps, and other design artifacts to communicate user insights.\n- Design and prototype end-to-end experiences that are both user-friendly and aligned with business goals.\n- Collaborate with product managers, engineers, and other stakeholders to bring experience designs to life.\n- Conduct usability testing and gather feedback to iterate on and improve the user experience.\n- Advocate for the user throughout the product development process.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of human-centered design principles and methodologies.\n- Expertise in user research, interaction design, and information architecture.\n- Strong empathy and a passion for understanding the needs of users.\n- Excellent communication, collaboration, and storytelling skills.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe XD.\n- A portfolio that demonstrates a strong understanding of experience design and a commitment to creating great user experiences.\n"
  },
  {
    "role-name": "Video Designer",
    "description": "A Video Designer is a creative professional who specializes in the design and creation of video content for a variety of platforms. They are a hybrid of a video editor, a motion graphics designer, and a storyteller, with a deep understanding of how to use video to communicate a message and to move an audience to action. They are passionate about creating videos that are both beautiful and effective.\n",
    "industry": "Media, Advertising\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of video content, from social media videos and explainer videos to corporate videos and commercials.\n- Collaborate with clients, marketers, and other stakeholders to understand the goals and content of the video.\n- Develop and execute a clear and compelling narrative for each video.\n- Stay current with the latest trends and best practices in video design.\n- Prepare and deliver videos in a variety of formats.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of video production, including shooting, editing, and sound design.\n- Proficiency in video editing and motion graphics software, such as Adobe Premiere Pro and After Effects.\n- A strong portfolio that showcases a range of video design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for storytelling.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Design System Designer",
    "description": "As a Design System Designer, you will be at the heart of our design operations, responsible for creating the design foundation, patterns, and guidelines that empower our product teams. Youll work across the entire design system lifecycle, from defining atomic components and maintaining documentation to ensuring code parity and facilitating adoption in our organisation. This role requires a blend of systematic thinking, pixel-perfect craftsmanship, and technical understanding to bridge the gap between design vision and engineering reality.\n\nYou'll be a key advocate for the internal user (designers and developers), championing efficiency and ensuring our digital products are consistent, scalable, and accessible. You'll collaborate closely with frontend engineers, product designers, content designers and brand stakeholders to translate requirements into a flexible, robust design system.\n",
    "industry": "Tech, SaaS\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Internal user research: Conduct research with product designers and developers to understand their workflows, friction points, and needs to improve the systems usability and adoption.\n- System architecture & tokens: Define and manage the logic of our design system (tokens, variables, and theming) to support multi-brand (white-label) and multi-platform needs.\n- Component craft: Design and build robust, high-quality Figma components that are flexible, responsive, and strictly adhere to our accessibility standards.\n- Technical alignment: Partner closely with frontend engineers to ensure design-to-code parity, minimizing the gap between what is designed and what is shipped.\n- Documentation & education: Write clear, concise usage guidelines and facilitate onboarding or design craft sessions to teach others how to use the system effectively.\n- Governance & maintenance: Manage library updates, versioning, and contribution workflows, ensuring the system evolves without breaking legacy products.\n- Inclusive & accessible: Bake accessibility (WCAG 2.1 AA) directly into the core components, ensuring that every product team inherits an inclusive foundation by default.\n- Metrics & health: Collaborate, define and follow-up design system usage, detachment rates, and adoption metrics to measure the efficiency and success of the design system.\n",
    "similar-to-other-roles": null,
    "skills": "- Systems thinking: The ability to see the connections between atomic elements and complex views, creating solutions that scale across multiple brands and platforms.\n- Technical understanding: A deep understanding of frontend development constraints (HTML/CSS, React, iOS/Android) to speak the same language as engineers.\n- Design thinker: Proven ability to facilitate contributions and manage feedback loops from multiple product teams.\n- Data-driven mindset: Proficiency in using library analytics to inform decisions on what to build, depreciate, or improve.\n- Analytical skills: Strong ability to organize information, naming conventions, and taxonomies for better discoverability.\n- Technical proficiency: Advanced knowledge of Figma (Auto-layout, Variables, Properties) and familiarity with Storybook or similar documentation tools.\n- Experience: X number of years of experience in UI and design system work, with a strong portfolio showcasing specific contributions to maintaining or building a design system.\n- Collaboration: Proven ability to work as a service-oriented partner, supporting other crafts rather than just delivering features.\n- Communication: Excellent written skills for documentation. The ability to explain why a pattern exists to both designers and developers.\n- Problem-solving: A passion for optimization and efficiencysolving the problem once so others don't have to.\n- Attention to detail: Obsessive attention to craft, spacing, and logic to ensure the system is bug-free and reliable.\n"
  },
  {
    "role-name": "Apparel Designer",
    "description": "An Apparel Designer is a creative professional who designs and develops clothing and accessories. They are involved in all aspects of the design process, from initial concept and sketching to selecting fabrics and creating technical specifications for production. This role requires a strong sense of style, a deep understanding of garment construction, and an awareness of current fashion trends.\n",
    "industry": "Fashion, Retail\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Research and analyze fashion trends to develop new design concepts.\n- Create sketches and illustrations of clothing and accessory designs.\n- Select fabrics, trims, and colors for each design.\n- Create detailed technical packs and specification sheets for manufacturers.\n- Collaborate with pattern makers and sample makers to create prototypes and samples.\n- Participate in fittings and provide feedback to ensure proper fit and construction.\n- Work closely with production teams to ensure designs are manufactured to a high standard.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong sketching and illustration abilities.\n- In-depth knowledge of fabrics, textiles, and garment construction.\n- Proficiency in Adobe Illustrator and Photoshop.\n- Understanding of the product development process from concept to production.\n- Excellent sense of style and color.\n- Strong communication and collaboration skills.\n- Ability to work in a fast-paced, deadline-driven environment.\n"
  },
  {
    "role-name": "Lead Ux Designer",
    "description": "A Lead UX Designer is a senior UX professional who is responsible for the UX design of a specific product, project, or team. They are a hands-on leader who is both a skilled UX designer and a mentor to other designers. They are responsible for ensuring that the UX work is aligned with the project's goals, and for guiding the team to create a high-quality, user-centered experience.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead the UX design of a specific product, project, or feature from concept to completion.\n- Provide guidance, feedback, and mentorship to other UX designers on the team.\n- Collaborate with product managers, engineers, and other stakeholders to ensure a cohesive and user-centered product.\n- Facilitate design critiques and reviews to ensure a high standard of quality.\n- Advocate for the user and for UX best practices.\n- Contribute to the development of the UX team's culture and processes.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in UX design, user research, and interaction design.\n- Strong leadership and mentoring skills.\n- Excellent communication, collaboration, and presentation skills.\n- A passion for creating high-quality, user-centered experiences.\n- A strong portfolio that demonstrates a deep understanding of the UX design process and a track record of success.\n- Ability to provide and receive constructive feedback.\n"
  },
  {
    "role-name": "Growth Product Designer",
    "description": "A Growth Product Designer is a user-centered design professional who is focused on driving business growth through the design of products and experiences. They are a hybrid of a product designer, a marketer, and a data analyst, with a deep understanding of how to use design to acquire, activate, and retain users. They are passionate about experimentation and are constantly looking for new and innovative ways to grow the business.\n",
    "industry": "Tech, SaaS\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and conduct experiments to test and validate new growth hypotheses.\n- Use data and analytics to identify opportunities for growth and to measure the impact of design changes.\n- Design and prototype new features and experiences that are designed to drive user acquisition, activation, and retention.\n- Collaborate with product managers, engineers, and marketers to execute on growth initiatives.\n- Stay current with the latest trends and best practices in growth design and experimentation.\n- Advocate for a data-informed and experimental approach to design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of user-centered design principles and methodologies.\n- Expertise in A/B testing and other experimentation methods.\n- Strong analytical and data-driven decision-making skills.\n- Excellent communication, collaboration, and storytelling skills.\n- A passion for growth and a creative mindset.\n- A portfolio that demonstrates a strong ability to use design to drive business results.\n"
  },
  {
    "role-name": "Ux Writer",
    "description": "A UX Writer is a user experience professional who specializes in the design of the language of a digital product. They are responsible for creating clear, concise, and helpful copy that guides users through the product and helps them achieve their goals. They are masters of the written word, with a deep understanding of how to use language to create a positive and engaging user experience.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Write, edit, and test copy for a wide range of user interface elements, from buttons and labels to error messages and onboarding flows.\n- Collaborate with UX designers, product managers, and engineers to create a cohesive and user-centered product.\n- Create and maintain a content style guide to ensure consistency and quality across all products.\n- Stay current with the latest trends and best practices in UX writing.\n- Advocate for a user-centered and content-first approach to design.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of UX writing, including clarity, conciseness, and voice and tone.\n- Proficiency in a variety of writing and editing tools.\n- A strong portfolio that showcases a range of UX writing skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for language.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Ethical Designer",
    "description": "An Ethical Designer is a design professional who is committed to creating products, services, and experiences that are not only user-friendly, but also responsible, fair, and just. They are critical thinkers who are passionate about using their design skills to make a positive impact on the world. They are the conscience of the design team, advocating for the rights and well-being of users and society as a whole.\n",
    "industry": "Tech, Social Impact\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Identify and assess the ethical risks and implications of design decisions.\n- Advocate for user privacy, data protection, and other ethical considerations.\n- Design for inclusivity, diversity, and accessibility.\n- Actively work to prevent the creation of dark patterns and other manipulative design practices.\n- Collaborate with other designers, product managers, engineers, and other stakeholders to embed ethical considerations into the design process.\n- Stay current with the latest research and best practices in ethical design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of ethical principles and frameworks.\n- Strong critical thinking and problem-solving skills.\n- Excellent communication, collaboration, and advocacy skills.\n- A passion for creating responsible, fair, and just products and services.\n- A commitment to lifelong learning and continuous improvement.\n- Experience in a variety of design disciplines is often a plus.\n"
  },
  {
    "role-name": "Motion Graphics Designer",
    "description": "A Motion Graphics Designer is a creative professional who specializes in the design and animation of graphic elements for a variety of media, including video, web, and broadcast. They are responsible for creating everything from animated logos and lower thirds to complex infographics and title sequences. They are masters of visual storytelling, with a deep understanding of how to use motion to communicate ideas and emotions.\n",
    "industry": "Broadcast, Advertising\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of motion graphics, including animated logos, lower thirds, infographics, and title sequences.\n- Collaborate with art directors, editors, and other stakeholders to develop and execute motion graphics concepts.\n- Stay current with the latest trends and techniques in motion graphics.\n- Manage multiple projects and deadlines.\n- Prepare files for a variety of platforms and formats.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of animation, including timing, spacing, and easing.\n- Proficiency in motion graphics software, such as Adobe After Effects, Cinema 4D, or Blender.\n- A strong portfolio that showcases a range of motion graphics skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for motion.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Ai Prototyping Designer",
    "description": "An AI Prototyping Designer is a hands-on designer and technologist who rapidly builds functional prototypes to explore and validate ideas for AI-powered products and features. This role requires a blend of design thinking and technical skills to quickly bring concepts to life, enabling teams to test assumptions, gather user feedback, and demonstrate the potential of AI in a tangible way.\n",
    "industry": "Tech, R&D\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Utilize AI tools, APIs, and platforms to build interactive prototypes of AI-driven concepts.\n- Work closely with product managers, designers, and engineers to quickly iterate on ideas and explore different approaches.\n- Conduct rapid user testing with prototypes to gather feedback and validate product concepts.\n- Stay current with the latest AI technologies and tools to identify new opportunities for innovation.\n- Communicate and demonstrate the functionality and value of AI prototypes to stakeholders.\n- Bridge the gap between design and engineering by creating prototypes that can inform technical development.\n",
    "similar-to-other-roles": null,
    "skills": "- Proficiency in prototyping and creative coding tools (e.g., Framer, ProtoPie, JavaScript, Python).\n- Experience working with APIs and integrating different services.\n- A strong understanding of design principles and user-centered design methodologies.\n- Excellent problem-solving skills and a bias for action.\n- Ability to learn new technologies and tools quickly.\n- Strong communication and presentation skills.\n"
  },
  {
    "role-name": "Digital Design Director",
    "description": "A Digital Design Director is a senior creative leader who is responsible for the overall digital design vision and execution for a company, a brand, or a portfolio of clients. They are a visionary and a mentor, with a passion for building and leading high-performing digital design teams. They are responsible for setting the bar for digital design excellence and for ensuring that the design team is creating work that is both innovative and effective.\n",
    "industry": "Agency, Tech\n",
    "medium": "Digital\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the digital design vision and strategy for the organization.\n- Lead and mentor a team of digital designers, providing guidance, feedback, and career development.\n- Oversee the design of all digital products, services, and experiences, ensuring a high standard of quality and consistency.\n- Collaborate with other creative leaders, as well as with product, engineering, and marketing teams, to ensure a cohesive and integrated brand experience.\n- Champion a user-centered and data-informed design culture.\n- Attract, hire, and retain top digital design talent.\n- Stay current with the latest trends and best practices in digital design.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in a variety of digital design disciplines, such as web design, mobile design, and interaction design.\n- A compelling portfolio of work that demonstrates a commitment to digital design excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing digital design teams.\n"
  },
  {
    "role-name": "Ux Researcher",
    "description": "A UX Researcher is a user experience professional who specializes in the understanding of user behaviors, needs, and motivations. They are the voice of the user in the product development process, and they use a variety of qualitative and quantitative research methods to generate insights that inform the design of products, services, and experiences. They are empathetic and analytical thinkers, with a passion for understanding people.\n",
    "industry": "Tech\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Plan and conduct a wide range of user research studies, including interviews, surveys, usability tests, and ethnographic research.\n- Analyze and synthesize research findings to generate actionable insights.\n- Communicate research insights to designers, product managers, engineers, and other stakeholders in a clear and compelling way.\n- Create user personas, journey maps, and other research artifacts to help the team build empathy for users.\n- Advocate for the user throughout the product development process.\n- Stay current with the latest trends and best practices in user research.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in a variety of qualitative and quantitative research methods.\n- Strong analytical and synthesis skills.\n- Excellent communication, collaboration, and storytelling skills.\n- A deep sense of empathy and a passion for understanding people.\n- A portfolio that demonstrates a strong ability to generate and communicate user insights.\n- Experience with a variety of research tools and technologies.\n"
  },
  {
    "role-name": "Insights Lead",
    "description": "An Insights Lead is a senior professional who is responsible for leading a team of researchers and analysts in the generation of consumer and market insights. They are a player-coach who is both a skilled researcher and a mentor to others. They are responsible for setting the vision and direction for the insights team, and for ensuring that the team is delivering high-quality work that drives business growth.\n",
    "industry": "Marketing, Tech\n",
    "medium": "Service\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead and mentor a team of researchers and analysts, providing guidance, feedback, and career development.\n- Develop and implement a research and insights strategy that is aligned with the company's business goals.\n- Oversee the execution of research projects from concept to completion.\n- Synthesize data from a variety of sources to generate actionable insights.\n- Communicate insights to stakeholders at all levels of the organization in a clear and compelling way.\n- Stay current with the latest trends and best practices in research and insights.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Expertise in a wide range of qualitative and quantitative research methods.\n- Excellent analytical and synthesis skills.\n- Strong communication, presentation, and storytelling skills.\n- A passion for understanding consumers and a deep curiosity about the market.\n- A strong track record of success in leading research and insights projects.\n"
  },
  {
    "role-name": "TillgaNglighets Strateg",
    "description": "En Tillgnglighetsstrateg fokuserar p helheten och utvecklar och implementerar lngsiktiga strategier fr att bdda in tillgnglighet i krnan av en organisations kultur, processer och produkter. De arbetar p systemniv fr att skerstlla att tillgnglighet inte bara r en checklista utan en grundlggande aspekt av hur organisationen fungerar.\n",
    "industry": "Gov, Enterprise\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Utveckla och fresprka en fretagsomfattande tillgnglighetsvision och strategi.\n- Skapa och implementera tillgnglighetspolicyer, standarder och styrningsmodeller.\n- Utforma och vervaka utrullningen av tillgnglighetsutbildning och medvetenhetsprogram ver hela organisationen.\n- Etablera nyckeltal och KPI:er fr att mta framstegen och effekten av tillgnglighetsinitiativ.\n- Samarbeta med ledningen fr att skra std och resurser fr tillgnglighet.\n- Identifiera och mildra tillgnglighetsrelaterade risker.\n- Frmja en kultur av tillgnglighet och inkludering i hela organisationen.\n- Samarbeta med juridiska och efterlevnadsteam fr att skerstlla efterlevnad av tillgnglighetslagar och frordningar.\n",
    "similar-to-other-roles": null,
    "skills": "- Beprvad erfarenhet av att utveckla och implementera strategiska initiativ.\n- Stark frstelse fr tillgnglighetsprinciper och standarder.\n- Utmrkta ledarskaps-, kommunikations- och pverkansfrdigheter.\n- Erfarenhet av frndringsledning och att driva kulturell omvandling.\n- Frmga att arbeta effektivt med ledande intressenter och fretagsledning.\n- Starka analytiska frdigheter fr att mta affrseffekten av tillgnglighet.\n- Kunskap om tillgnglighetslagar och frordningar.\n"
  },
  {
    "role-name": "User Research Manager",
    "description": "A User Research Manager is a leader who is responsible for the health, happiness, and performance of a team of user researchers. They are a coach, a mentor, and a facilitator, with a passion for helping user researchers do their best work. They are responsible for creating a supportive and collaborative environment where user researchers can learn, grow, and thrive.\n",
    "industry": "Tech\n",
    "medium": "Service\n",
    "org-level": "Manager\n",
    "responsibilities": "- Manage a team of user researchers, including hiring, onboarding, performance reviews, and career development.\n- Provide coaching, mentorship, and guidance to user researchers.\n- Foster a positive and inclusive team culture.\n- Manage the team's workload and resources.\n- Facilitate communication and collaboration within the user research team and with other departments.\n- Advocate for the needs of the user research team.\n- Continuously improve the user research team's processes and workflows.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and people management skills.\n- A deep understanding of the user research process and the needs of user researchers.\n- Excellent coaching, mentoring, and facilitation skills.\n- Strong communication and interpersonal skills.\n- A passion for building and leading high-performing teams.\n- Experience as a user researcher is often a plus.\n"
  },
  {
    "role-name": "Ar Designer",
    "description": "An AR Designer, or Augmented Reality Designer, creates immersive and interactive experiences that blend the digital and physical worlds. This role involves designing and prototyping AR applications, from social media filters to complex industrial and educational tools. They need a unique combination of skills in 3D design, user experience (UX), and spatial computing to create intuitive and engaging augmented reality experiences.\n",
    "industry": "Tech, Marketing, Gaming\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and conceptualize AR experiences, including user flows, interactions, and visual interfaces for spatial computing.\n- Create 3D models, animations, and other assets for use in AR applications.\n- Prototype and iterate on AR experiences using platforms like Unity, Unreal Engine, or AR-specific software like Spark AR and Lens Studio.\n- Collaborate with developers to implement AR features and ensure a high-quality user experience.\n- Conduct user testing and gather feedback to refine and improve AR experiences.\n- Stay up-to-date with the latest trends and technologies in augmented reality.\n",
    "similar-to-other-roles": null,
    "skills": "- Proficiency in 3D modeling and animation software (e.g., Blender, Maya, Cinema 4D).\n- Experience with AR development platforms such as Unity, Unreal Engine, Spark AR, or Lens Studio.\n- Strong understanding of user experience (UX) principles, particularly for spatial and 3D interfaces.\n- A good sense of spatial awareness and the ability to design for the physical world.\n- Creative thinking and problem-solving skills.\n- Strong collaboration and communication skills.\n"
  },
  {
    "role-name": "Learning Designer",
    "description": "A Learning Designer is a professional who specializes in the design and development of learning experiences. They are experts in how people learn, and they use that knowledge to create effective and engaging training materials, courses, and other educational content. They are passionate about helping people learn and grow, and they are skilled in a variety of design and development tools.\n",
    "industry": "EdTech, Education\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and develop a wide range of learning experiences, from e-learning modules and instructor-led training to videos and job aids.\n- Collaborate with subject matter experts to understand the learning needs of the audience.\n- Apply learning theories and models to the design of learning experiences.\n- Create engaging and interactive learning content that is tailored to the needs of the learner.\n- Evaluate the effectiveness of learning experiences and make improvements as needed.\n- Stay current with the latest trends and best practices in learning design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of learning theories and models.\n- Expertise in a variety of authoring tools, such as Articulate Storyline, Adobe Captivate, or Camtasia.\n- Strong writing, editing, and communication skills.\n- Excellent project management and organizational skills.\n- A passion for learning and a creative mindset.\n- A portfolio that demonstrates a strong ability to design and develop effective learning experiences.\n"
  },
  {
    "role-name": "Vp Of Design",
    "description": "A VP of Design is a senior executive who is responsible for the overall design vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing design teams. They are responsible for setting the bar for design excellence and for ensuring that the design team is creating work that is both beautiful and effective. They are a key member of the executive team and play a critical role in shaping the company's strategy and culture.\n",
    "industry": "Tech, Enterprise\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the design vision and strategy for the company.\n- Lead and mentor a team of design directors and managers, providing guidance, feedback, and career development.\n- Oversee the design of all products, services, and experiences, ensuring a high standard of quality and consistency.\n- Collaborate with other executives to ensure that design is integrated into the entire business.\n- Champion a user-centered design culture throughout the company.\n- Attract, hire, and retain top design talent.\n- Manage the design budget and resources.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in a variety of design disciplines, such as UX design, product design, or brand design.\n- A compelling portfolio of work that demonstrates a commitment to design excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing design teams.\n"
  },
  {
    "role-name": "Interaction Designer",
    "description": "An Interaction Designer (IxD) is a user experience professional who specializes in the design of the interaction between users and digital products. They are responsible for creating intuitive, efficient, and enjoyable experiences by focusing on the flow, behavior, and feedback of the user interface. They are passionate about understanding how users think and behave, and they use that knowledge to create designs that are both easy and delightful to use.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and prototype the interaction patterns, behaviors, and animations for digital products.\n- Create wireframes, user flows, and other design artifacts to communicate interaction design concepts.\n- Collaborate with UX designers, visual designers, and engineers to create a cohesive and user-centered experience.\n- Conduct user research and usability testing to validate and iterate on interaction designs.\n- Stay current with the latest trends and best practices in interaction design.\n- Advocate for a user-centered and iterative approach to design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of interaction design principles and best practices.\n- Expertise in a variety of design and prototyping tools, such as Figma, Sketch, or ProtoPie.\n- Strong analytical and problem-solving skills.\n- Excellent communication and collaboration skills.\n- A passion for creating intuitive and engaging user experiences.\n- A portfolio that demonstrates a strong ability to design and prototype complex interactions.\n"
  },
  {
    "role-name": "Ux Strategist",
    "description": "A UX Strategist is a senior user experience professional who is responsible for aligning the user experience with the overall business strategy. They are a big-picture thinker who is passionate about creating user experiences that are not only user-friendly, but also drive business results. They are experts in understanding the needs of both users and the business, and in creating a UX strategy that meets those needs.\n",
    "industry": "Tech, Agency\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Develop and articulate a clear and compelling UX strategy for a product, a business unit, or a company.\n- Conduct user research, market analysis, and competitive analysis to identify opportunities for innovation.\n- Collaborate with senior leaders in product, engineering, and marketing to ensure that the UX strategy is aligned with the overall business strategy.\n- Create and maintain a UX roadmap that prioritizes the most important UX initiatives.\n- Measure and track the impact of the UX strategy on key business metrics.\n- Advocate for a user-centered and data-informed approach to design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of UX strategy and how it relates to business strategy.\n- Expertise in a variety of research and strategy frameworks.\n- Strong analytical and strategic thinking skills.\n- Excellent communication, presentation, and influencing skills.\n- A passion for creating user experiences that drive business results.\n- A portfolio that demonstrates a strong ability to think strategically about UX.\n"
  },
  {
    "role-name": "Chief Design Officer (Cdo)",
    "description": "A Chief Design Officer (CDO) is a senior executive responsible for a company's overall design strategy and execution. They champion a human-centered design philosophy at the highest level of the organization, ensuring that design is a key driver of business success and innovation. The CDO is a visionary leader who elevates the role of design in creating exceptional products, services, and brand experiences.\n",
    "industry": "Tech, Enterprise\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Define and articulate the company's design vision, strategy, and principles.\n- Lead and inspire a high-performing design organization, including product design, user research, and brand design.\n- Act as the primary advocate for the user at the executive level.\n- Collaborate with the CEO, CPO, and other C-suite executives to align design with business goals and product strategy.\n- Foster a strong design culture that values creativity, collaboration, and user-centricity.\n- Oversee the design of the entire customer journey, ensuring a cohesive and delightful experience.\n- Drive innovation by applying design thinking to complex business challenges.\n",
    "similar-to-other-roles": null,
    "skills": "- Proven track record of leading and scaling design teams in a fast-paced, innovative environment.\n- Deep expertise in human-centered design, user research, and product design.\n- Exceptional leadership, communication, and storytelling abilities.\n- Strong business acumen and the ability to connect design to business outcomes.\n- Experience in building and nurturing a world-class design culture.\n- A compelling portfolio of work that demonstrates a commitment to design excellence and innovation.\n- Ability to influence and build consensus at all levels of the organization.\n"
  },
  {
    "role-name": "Director Of Ux",
    "description": "A Director of UX is a senior leader who is responsible for the overall user experience (UX) vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing UX teams. They are responsible for setting the bar for UX excellence and for ensuring that the UX team is creating products that are both user-friendly and valuable to the business.\n",
    "industry": "Tech, Enterprise\n",
    "medium": "Digital\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the UX vision and strategy for the organization.\n- Lead and mentor a team of UX designers, researchers, and other UX professionals, providing guidance, feedback, and career development.\n- Oversee the UX of all products, ensuring a high standard of quality, consistency, and usability.\n- Collaborate with other leaders in product, engineering, and marketing to ensure a cohesive and integrated user experience.\n- Champion a user-centered design culture throughout the organization.\n- Attract, hire, and retain top UX talent.\n- Stay current with the latest trends and best practices in UX.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in UX design, user research, and interaction design.\n- A compelling portfolio of work that demonstrates a commitment to UX excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing UX teams.\n"
  },
  {
    "role-name": "Digital Strategist",
    "description": "A Digital Strategist is a forward-thinking professional who is responsible for developing and executing the digital strategy for a company or a brand. They are experts in the digital landscape, with a deep understanding of how to use digital channels and technologies to achieve business goals. They are analytical and creative thinkers, with a passion for using data to drive results.\n",
    "industry": "Marketing, Consulting\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Develop and execute a comprehensive digital strategy that is aligned with the company's business goals.\n- Conduct research and analysis to identify trends, opportunities, and threats in the digital landscape.\n- Develop and manage digital marketing campaigns across a variety of channels, such as SEO, SEM, social media, and email.\n- Analyze and report on the performance of digital marketing campaigns.\n- Identify and evaluate new and emerging digital technologies.\n- Collaborate with other teams, such as marketing, sales, and product, to ensure a cohesive and integrated digital presence.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in digital marketing, including SEO, SEM, social media, and email marketing.\n- Strong analytical and data-driven decision-making skills.\n- Excellent communication, presentation, and interpersonal skills.\n- A passion for the digital world and a deep understanding of the latest trends and technologies.\n- A strategic and creative mindset.\n- Experience with a variety of digital marketing tools and technologies.\n"
  },
  {
    "role-name": "Head Of Service Design",
    "description": "A Head of Service Design is a senior leader who is responsible for the overall service design vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing service design teams. They are responsible for setting the bar for service design excellence and for ensuring that the service design team is creating end-to-end service experiences that are both user-friendly and valuable to the business.\n",
    "industry": "Service, Gov\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the service design vision and strategy for the organization.\n- Lead and mentor a team of service designers, providing guidance, feedback, and career development.\n- Oversee the design of all service experiences, ensuring a high standard of quality, consistency, and user-friendliness.\n- Collaborate with other leaders in product, marketing, and operations to ensure a cohesive and integrated service experience.\n- Champion a human-centered and systems-thinking approach to service design.\n- Attract, hire, and retain top service design talent.\n- Stay current with the latest trends and best practices in service design.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in service design, systems thinking, and user research.\n- A compelling portfolio of work that demonstrates a commitment to service design excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing service design teams.\n"
  },
  {
    "role-name": "Exterior Designer",
    "description": "An Exterior Designer is a creative professional who specializes in the design of the exterior of products, vehicles, and buildings. They are responsible for the overall aesthetic and form of the exterior, ensuring that it is not only visually appealing, but also functional and manufacturable. They are sculptors of form, with a deep understanding of materials, manufacturing processes, and the emotional impact of design.\n",
    "industry": "Automotive, Architecture\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Develop and sketch a wide range of exterior design concepts.\n- Create detailed 3D models and renderings of exterior designs.\n- Collaborate with engineers, aerodynamicists, and other specialists to ensure that the exterior design is both beautiful and functional.\n- Select and specify materials and finishes for the exterior.\n- Create and present design concepts to clients and internal stakeholders.\n- Stay current with the latest trends and technologies in exterior design.\n",
    "similar-to-other-roles": null,
    "skills": "- Exceptional sketching and 3D modeling skills.\n- A deep understanding of form, proportion, and surface development.\n- Expertise in 3D modeling and rendering software, such as Alias, Rhino, or VRED.\n- A strong sense of aesthetics and a passion for creating beautiful and innovative designs.\n- Excellent communication and collaboration skills.\n- A portfolio that showcases a strong ability to create compelling and innovative exterior designs.\n"
  },
  {
    "role-name": "Vp Of Product Design",
    "description": "A VP of Product Design is a senior executive who is responsible for the overall product design vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing product design teams. They are responsible for setting the bar for product design excellence and for ensuring that the product design team is creating products that are both user-friendly and valuable to the business. They are a key member of the executive team and play a critical role in shaping the company's product strategy.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the product design vision and strategy for the company.\n- Lead and mentor a team of product design directors and managers, providing guidance, feedback, and career development.\n- Oversee the design of all products, ensuring a high standard of quality, consistency, and user-friendliness.\n- Collaborate with other executives to ensure that product design is integrated into the entire business.\n- Champion a user-centered and data-informed design culture throughout the company.\n- Attract, hire, and retain top product design talent.\n- Manage the product design budget and resources.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in product design, UX design, and user research.\n- A compelling portfolio of work that demonstrates a commitment to product design excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing product design teams.\n"
  },
  {
    "role-name": "Head Of Design",
    "description": "A Head of Design is a senior leader who is responsible for the overall design vision, strategy, and execution for a company, a business unit, or a product line. They are a visionary and a mentor, with a passion for building and leading high-performing design teams. They are responsible for setting the bar for design excellence and for ensuring that the design team is creating work that is both beautiful and effective.\n",
    "industry": "Tech, Agency\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the design vision and strategy for the organization.\n- Lead and mentor a team of designers and design managers, providing guidance, feedback, and career development.\n- Oversee the design of all products, services, and experiences, ensuring a high standard of quality and consistency.\n- Collaborate with other leaders in product, engineering, and marketing to ensure a cohesive and integrated brand and user experience.\n- Champion a user-centered design culture throughout the organization.\n- Attract, hire, and retain top design talent.\n- Manage the design budget and resources.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in a variety of design disciplines, such as UX design, product design, or brand design.\n- A compelling portfolio of work that demonstrates a commitment to design excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing design teams.\n"
  },
  {
    "role-name": "Design Manager",
    "description": "A Design Manager is a people leader who is responsible for the health, happiness, and performance of a team of designers. They are a coach, a mentor, and a facilitator, with a passion for helping designers do their best work. They are responsible for creating a supportive and collaborative environment where designers can learn, grow, and thrive.\n",
    "industry": "Tech, In-house\n",
    "medium": "Service\n",
    "org-level": "Manager\n",
    "responsibilities": "- Manage a team of designers, including hiring, onboarding, performance reviews, and career development.\n- Provide coaching, mentorship, and guidance to designers.\n- Foster a positive and inclusive team culture.\n- Manage the team's workload and resources.\n- Facilitate communication and collaboration within the design team and with other departments.\n- Advocate for the needs of the design team.\n- Continuously improve the design team's processes and workflows.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and people management skills.\n- A deep understanding of the design process and the needs of designers.\n- Excellent coaching, mentoring, and facilitation skills.\n- Strong communication and interpersonal skills.\n- A passion for building and leading high-performing teams.\n- Experience as a designer is often a plus.\n"
  },
  {
    "role-name": "Voice Ui Designer",
    "description": "A Voice UI Designer is a user experience professional who specializes in the design of voice-based interactions. They are responsible for creating voice user interfaces (VUIs) that are not only natural and intuitive, but also efficient and enjoyable to use. They are masters of the spoken word, with a deep understanding of linguistics, conversation design, and the nuances of human speech.\n",
    "industry": "Tech\n",
    "medium": "Sound\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create the voice user interface for a wide range of products, from smart speakers and mobile apps to in-car assistants and interactive voice response (IVR) systems.\n- Collaborate with UX designers, product managers, and engineers to create a cohesive and user-centered product.\n- Create and maintain a voice and tone guide to ensure consistency and quality across all products.\n- Stay current with the latest trends and best practices in voice UI design.\n- Prepare and deliver VUI specifications to the engineering team.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of voice UI design, including conversation design, persona design, and error handling.\n- Proficiency in a variety of VUI design and prototyping tools.\n- A strong portfolio that showcases a range of VUI design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for voice.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Cx Lead",
    "description": "A CX Lead, or Customer Experience Lead, is a senior-level professional who is responsible for leading and guiding a team of CX designers and researchers. They are a player-coach who is both a skilled CX practitioner and a mentor to others. They are responsible for setting the vision and direction for the CX team, and for ensuring that the team is delivering high-quality work that meets the needs of both customers and the business.\n",
    "industry": "Tech, Service\n",
    "medium": "Service\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead and mentor a team of CX designers and researchers.\n- Develop and implement a CX strategy that is aligned with the company's business goals.\n- Oversee the design and execution of CX projects from concept to completion.\n- Champion a customer-centric culture throughout the organization.\n- Collaborate with product, engineering, and other teams to ensure a cohesive and consistent customer experience.\n- Establish and track key CX metrics to measure the success of the team's work.\n- Stay current with the latest trends and best practices in CX.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Expertise in customer experience, service design, and user research.\n- Excellent communication, presentation, and facilitation skills.\n- A data-driven mindset and a focus on results.\n- A passion for building and mentoring high-performing teams.\n- A strong portfolio that demonstrates a deep understanding of CX and a track record of success.\n"
  },
  {
    "role-name": "Concept Designer",
    "description": "A Concept Designer, also known as a Concept Artist, is a creative visionary who specializes in the early stages of visual development. They are responsible for generating the initial ideas and visual direction for characters, environments, creatures, and props in industries like video games, film, and animation. They are masters of visual brainstorming, quickly exploring a wide range of ideas to find the most compelling and innovative solutions.\n",
    "industry": "Entertainment, Gaming, Product\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Brainstorm and generate a wide variety of ideas and sketches based on project briefs and art direction.\n- Create detailed concept art that establishes the mood, tone, and visual style of a project.\n- Design characters, environments, and props that are both visually appealing and functional for the needs of the project.\n- Collaborate with art directors, writers, and other designers to develop and refine the visual world of a project.\n- Iterate on designs based on feedback and creative direction.\n- Produce high-quality, polished concept art for presentation and production purposes.\n",
    "similar-to-other-roles": null,
    "skills": "- Exceptional drawing, painting, and illustration skills.\n- Strong understanding of art fundamentals, including composition, color theory, lighting, and perspective.\n- Ability to work in a variety of styles and genres.\n- Proficiency in digital art software such as Photoshop, Procreate, or Painter.\n- A strong imagination and a passion for visual storytelling.\n- Excellent communication and collaboration skills.\n- A portfolio that showcases a strong sense of creativity and visual problem-solving.\n"
  },
  {
    "role-name": "Principal Designer",
    "description": "A Principal Designer is a senior individual contributor who is a recognized expert in their field. They are a visionary and a mentor, with a passion for solving the most complex and challenging design problems. They are responsible for setting the bar for design excellence and for driving innovation across the organization. They are a force multiplier, who makes everyone around them better.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead the design of the most complex and strategic projects.\n- Provide guidance, feedback, and mentorship to other designers.\n- Collaborate with senior leaders in product, engineering, and other departments to shape the direction of the product.\n- Drive the development of the design team's culture, processes, and craft.\n- Stay current with the latest trends and best practices in design and technology.\n- Represent the company at conferences and other industry events.\n",
    "similar-to-other-roles": null,
    "skills": "- Deep expertise in a variety of design disciplines, such as UX design, product design, or systems design.\n- A compelling portfolio of work that demonstrates a commitment to design excellence and innovation.\n- Excellent communication, collaboration, and influencing skills.\n- A passion for solving complex problems and a creative mindset.\n- A strong track record of success in leading large and complex design projects.\n- Ability to provide and receive constructive feedback.\n"
  },
  {
    "role-name": "Experience Designer",
    "description": "An Experience Designer (XD) is a human-centered design professional who is responsible for the overall experience of a product, service, or brand. They are strategic and empathetic thinkers who use a variety of design and research methods to understand the needs and motivations of users. They are the architects of the user journey, designing every interaction to be as intuitive, enjoyable, and valuable as possible.\n",
    "industry": "Tech, Agency\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Conduct user research to understand the needs, behaviors, and pain points of users.\n- Create user personas, journey maps, and other design artifacts to communicate user insights.\n- Design and prototype end-to-end experiences that are both user-friendly and aligned with business goals.\n- Collaborate with product managers, engineers, and other stakeholders to bring experience designs to life.\n- Conduct usability testing and gather feedback to iterate on and improve the user experience.\n- Advocate for the user throughout the product development process.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of human-centered design principles and methodologies.\n- Expertise in user research, interaction design, and information architecture.\n- Strong empathy and a passion for understanding the needs of users.\n- Excellent communication, collaboration, and storytelling skills.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe XD.\n- A portfolio that demonstrates a strong understanding of experience design and a commitment to creating great user experiences.\n"
  },
  {
    "role-name": "Transformation Lead",
    "description": "A Transformation Lead is a senior professional who is responsible for leading a team of transformation specialists and for the overall quality of the transformation work. They are a player-coach who is both a skilled transformation practitioner and a mentor to others. They are responsible for setting the vision and direction for the transformation team, and for ensuring that the team is delivering high-quality work that drives business growth.\n",
    "industry": "Consulting\n",
    "medium": "Service\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead and mentor a team of transformation specialists, providing guidance, feedback, and career development.\n- Develop and implement a transformation strategy that is aligned with the company's business goals.\n- Oversee the execution of transformation projects from concept to completion.\n- Champion a culture of transformation throughout the organization.\n- Collaborate with other teams to ensure that transformation is integrated into the entire product development process.\n- Establish and track key transformation metrics to measure the success of the team's work.\n- Stay current with the latest trends and best practices in transformation.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Expertise in transformation methodologies, such as change management, business process reengineering, and organizational design.\n- Excellent communication, presentation, and facilitation skills.\n- A data-driven mindset and a focus on results.\n- A passion for building and mentoring high-performing teams.\n- A strong track record of success in leading transformation projects.\n"
  },
  {
    "role-name": "Human Factors Designer",
    "description": "A Human Factors Designer is a specialist who applies the principles of human factors and ergonomics to the design of products, systems, and environments. They are focused on creating solutions that are safe, effective, and satisfying for people to use. They are human-centered designers with a deep understanding of human capabilities and limitations, both physical and cognitive.\n",
    "industry": "Medical, Industrial\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Conduct research and analysis to understand the capabilities and limitations of users in a particular context.\n- Apply human factors principles to the design of products, systems, and environments.\n- Create and test prototypes to evaluate the usability, safety, and effectiveness of designs.\n- Collaborate with engineers, designers, and other stakeholders to ensure that human factors considerations are integrated into the design process.\n- Stay current with the latest research and best practices in human factors and ergonomics.\n- Ensure that designs comply with relevant safety and accessibility standards.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of human factors and ergonomics principles.\n- Expertise in a variety of research methods, such as task analysis, user observation, and cognitive walkthroughs.\n- Strong analytical and problem-solving skills.\n- Excellent communication and collaboration skills.\n- A passion for creating safe, effective, and satisfying products and systems.\n- A degree in human factors, ergonomics, or a related field is often required.\n"
  },
  {
    "role-name": "Design Engineer",
    "description": "A Design Engineer is a hybrid professional who sits at the intersection of design and engineering. They are a designer who can code, and a developer who has a deep understanding of design principles. They are responsible for building and maintaining the front-end of digital products, ensuring that they are not only functional and performant, but also beautiful and easy to use. They are the bridge between the design and engineering teams, helping to ensure that the final product is a perfect reflection of the original design vision.\n",
    "industry": "Tech, SaaS\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Translate design mockups and prototypes into high-quality, production-ready code.\n- Build and maintain reusable UI components and design systems.\n- Collaborate with designers to create and prototype new user experiences.\n- Ensure that the front-end of the product is accessible, performant, and responsive.\n- Stay current with the latest trends and best practices in front-end development and design.\n- Act as a bridge between the design and engineering teams, helping to foster a collaborative and user-centered culture.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in front-end technologies, such as HTML, CSS, and JavaScript.\n- Experience with modern JavaScript frameworks, such as React, Vue, or Angular.\n- A strong understanding of design principles, including typography, color, and layout.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe XD.\n- A passion for creating beautiful and user-friendly interfaces.\n- Excellent communication and collaboration skills.\n- A portfolio that showcases a strong ability to bridge the gap between design and engineering.\n"
  },
  {
    "role-name": "Vp Of Service Design",
    "description": "A VP of Service Design is a senior executive who is responsible for the overall service design vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing service design teams. They are responsible for setting the bar for service design excellence and for ensuring that the service design team is creating end-to-end service experiences that are both user-friendly and valuable to the business. They are a key member of the executive team and play a critical role in shaping the company's strategy and culture.\n",
    "industry": "Service, Finance\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the service design vision and strategy for the company.\n- Lead and mentor a team of service design directors and managers, providing guidance, feedback, and career development.\n- Oversee the design of all service experiences, ensuring a high standard of quality, consistency, and user-friendliness.\n- Collaborate with other executives to ensure that service design is integrated into the entire business.\n- Champion a human-centered and systems-thinking approach to service design.\n- Attract, hire, and retain top service design talent.\n- Manage the service design budget and resources.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in service design, systems thinking, and user research.\n- A compelling portfolio of work that demonstrates a commitment to service design excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing service design teams.\n"
  },
  {
    "role-name": "Content Manager",
    "description": "A Content Manager is a strategic and operational leader who is responsible for the planning, creation, and distribution of content. They oversee the entire content lifecycle, from ideation and creation to publication and analysis. They are responsible for ensuring that all content is on-brand, meets a high standard of quality, and achieves its business objectives.\n",
    "industry": "Marketing, Media\n",
    "medium": "Digital\n",
    "org-level": "Manager\n",
    "responsibilities": "- Develop and manage a content strategy and editorial calendar.\n- Oversee a team of content creators, including writers, editors, and designers.\n- Manage the creation, editing, and publication of content across various channels, such as websites, blogs, and social media.\n- Ensure that all content is optimized for search engines (SEO).\n- Analyze content performance using data and analytics, and use insights to improve future content.\n- Manage the content budget and resources.\n- Stay current with content marketing trends and best practices.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Expertise in content strategy, creation, and distribution.\n- A deep understanding of SEO and digital marketing.\n- Excellent writing, editing, and communication skills.\n- Strong project management and organizational skills.\n- A data-driven mindset and a focus on results.\n- Experience with content management systems (CMS) and other marketing technologies.\n"
  },
  {
    "role-name": "Cx Specialist",
    "description": "A CX Specialist, or Customer Experience Specialist, is a professional who is focused on the analysis and improvement of the customer experience. They are data-driven and customer-obsessed, with a passion for identifying and solving customer problems. They work closely with customer support, product, and other teams to ensure that the voice of the customer is heard and acted upon.\n",
    "industry": "Customer Support, Tech\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Analyze customer feedback from a variety of sources, such as surveys (NPS, CSAT), support tickets, and social media.\n- Identify and prioritize key pain points and friction points in the customer journey.\n- Collaborate with cross-functional teams to develop and implement solutions to customer problems.\n- Track and measure the impact of CX initiatives on key metrics.\n- Create and maintain reports and dashboards to communicate customer insights to stakeholders.\n- Act as a voice for the customer within the organization.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong analytical and problem-solving skills.\n- Experience with data analysis and visualization tools.\n- A deep understanding of customer service and support processes.\n- Excellent communication and collaboration skills.\n- A passion for understanding and helping customers.\n- Experience with CRM and customer feedback management software.\n"
  },
  {
    "role-name": "Head Of Product Design",
    "description": "A Head of Product Design is a senior leader who is responsible for the overall product design vision, strategy, and execution for a company or a product line. They are a visionary and a mentor, with a passion for building and leading high-performing product design teams. They are responsible for setting the bar for product design excellence and for ensuring that the design team is creating products that are both user-friendly and valuable to the business.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the product design vision and strategy.\n- Lead and mentor a team of product designers and design managers, providing guidance, feedback, and career development.\n- Oversee the design of all products, ensuring a high standard of quality, consistency, and user-friendliness.\n- Collaborate with other leaders in product, engineering, and marketing to ensure a cohesive and integrated product experience.\n- Champion a user-centered and data-informed design culture.\n- Attract, hire, and retain top product design talent.\n- Stay current with the latest trends and best practices in product design.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in product design, UX design, and user research.\n- A compelling portfolio of work that demonstrates a commitment to product design excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing product design teams.\n"
  },
  {
    "role-name": "Email Designer",
    "description": "An Email Designer is a creative professional who specializes in designing and coding email marketing campaigns. They are responsible for creating emails that are not only visually appealing, but also responsive, accessible, and optimized for conversion. They are a hybrid of a designer and a developer, with a deep understanding of the unique challenges and opportunities of the email channel.\n",
    "industry": "Marketing, E-commerce\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and code responsive and accessible HTML email templates.\n- Create visually engaging email designs that are aligned with the company's brand and marketing goals.\n- Test emails across a variety of email clients and devices to ensure a consistent and high-quality experience.\n- Collaborate with marketers and copywriters to develop and execute email marketing campaigns.\n- Stay current with the latest trends and best practices in email design and development.\n- Optimize emails for deliverability, open rates, and click-through rates.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in HTML and CSS for email.\n- Strong graphic design skills and a keen eye for detail.\n- Experience with email marketing platforms and testing tools, such as Litmus or Email on Acid.\n- A deep understanding of email marketing best practices, including responsive design, accessibility, and deliverability.\n- A portfolio that demonstrates a strong ability to design and code effective email campaigns.\n- Excellent communication and collaboration skills.\n"
  },
  {
    "role-name": "Web Designer",
    "description": "A Web Designer is a creative professional who specializes in the design of websites. They are responsible for creating websites that are not only visually appealing, but also user-friendly, accessible, and optimized for search engines. They are masters of the web, with a deep understanding of web design principles, front-end technologies, and the ever-changing landscape of the internet.\n",
    "industry": "Agency, Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of websites, from simple landing pages to complex e-commerce sites.\n- Collaborate with clients, developers, and other stakeholders to understand the goals and requirements of the website.\n- Develop and execute web design concepts from initial wireframe to final implementation.\n- Stay current with the latest trends and best practices in web design.\n- Prepare and deliver design assets to the development team.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of web design, including responsive design, accessibility, and SEO.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe XD.\n- A strong portfolio that showcases a range of web design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for the web.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Environment Artist",
    "description": "An Environment Artist is a 3D artist who specializes in creating the worlds and settings for video games, films, and other digital media. They are responsible for building everything from vast landscapes and futuristic cities to detailed interior spaces. They are world-builders who use their artistic and technical skills to create immersive and believable environments that tell a story and draw the viewer in.\n",
    "industry": "Gaming, Film\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Model and texture 3D environments, including terrain, buildings, and props.\n- Create and place assets in a game engine or 3D software to build out the environment.\n- Set up lighting and atmospheric effects to create a specific mood and tone.\n- Optimize environments for performance and memory usage.\n- Collaborate with level designers, concept artists, and other team members to create a cohesive and immersive world.\n- Stay current with the latest trends and techniques in 3D environment art.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in 3D modeling and texturing software, such as Maya, 3ds Max, or Blender.\n- Experience with game engines, such as Unreal Engine or Unity.\n- Strong understanding of art fundamentals, including composition, color theory, and lighting.\n- A keen eye for detail and a passion for creating immersive worlds.\n- Excellent problem-solving and collaboration skills.\n- A portfolio that showcases a strong ability to create high-quality 3D environments.\n"
  },
  {
    "role-name": "Narrative Designer",
    "description": "A Narrative Designer is a writer and designer who specializes in the creation of stories and narrative experiences for interactive media, such as video games. They are responsible for designing the overall narrative structure, characters, and dialogue of a game, as well as for integrating the story with the gameplay. They are passionate about creating immersive and emotionally resonant experiences for players.\n",
    "industry": "Gaming\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and document the overall narrative structure of a game.\n- Create and develop the characters, world, and lore of a game.\n- Write dialogue, scripts, and other in-game text.\n- Collaborate with game designers, artists, and programmers to integrate the narrative with the gameplay.\n- Playtest and provide feedback on the game to ensure a high-quality narrative experience.\n- Stay current with the latest trends and best practices in narrative design.\n",
    "similar-to-other-roles": null,
    "skills": "- Exceptional writing, editing, and storytelling skills.\n- A deep understanding of narrative design principles and techniques.\n- Excellent communication and collaboration skills.\n- A passion for playing and making games.\n- Experience with a variety of narrative design tools and technologies is often a plus.\n- A portfolio that demonstrates a strong understanding of narrative design and a creative mindset.\n"
  },
  {
    "role-name": "Game Designer",
    "description": "A Game Designer is the architect of the player's experience in a video game. They are responsible for designing the gameplay, rules, systems, and mechanics that make a game fun and engaging. They are creative and analytical thinkers, with a deep understanding of what makes games tick. They are passionate about creating immersive and memorable experiences for players.\n",
    "industry": "Gaming\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and document game mechanics, systems, and features.\n- Create and balance game content, such as levels, characters, and items.\n- Prototype and iterate on gameplay ideas.\n- Collaborate with artists, programmers, and other team members to bring the game to life.\n- Playtest and provide feedback on the game to ensure a high-quality player experience.\n- Stay current with the latest trends and best practices in game design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of game design principles and mechanics.\n- Strong analytical and problem-solving skills.\n- Excellent communication and collaboration skills.\n- A passion for playing and making games.\n- Experience with game engines, such as Unreal Engine or Unity, is often a plus.\n- A portfolio that demonstrates a strong understanding of game design and a creative mindset.\n"
  },
  {
    "role-name": "Ux Ui Designer",
    "description": "A UX/UI Designer is a creative professional who is responsible for the design of both the user experience (UX) and the user interface (UI) of a digital product. They are a hybrid of a UX designer and a UI designer, with a deep understanding of how to create products that are not only beautiful, but also intuitive, easy to use, and accessible. They are passionate about creating user experiences that are both elegant and effective.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of user interface elements, from buttons and icons to complex data visualizations.\n- Create wireframes, user flows, and other design artifacts to communicate interaction design concepts.\n- Collaborate with product managers, engineers, and other stakeholders to create a cohesive and user-centered product.\n- Create and maintain a design system to ensure consistency and quality across all products.\n- Stay current with the latest trends and best practices in UX and UI design.\n- Prepare and deliver design assets to the engineering team.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of both UX and UI design.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe XD.\n- A strong portfolio that showcases a range of UX and UI design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for design.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Ux Design Manager",
    "description": "A UX Design Manager is a leader who is responsible for the health, happiness, and performance of a team of UX designers. They are a coach, a mentor, and a facilitator, with a passion for helping UX designers do their best work. They are responsible for creating a supportive and collaborative environment where UX designers can learn, grow, and thrive.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "Manager\n",
    "responsibilities": "- Manage a team of UX designers, including hiring, onboarding, performance reviews, and career development.\n- Provide coaching, mentorship, and guidance to UX designers.\n- Foster a positive and inclusive team culture.\n- Manage the team's workload and resources.\n- Facilitate communication and collaboration within the UX design team and with other departments.\n- Advocate for the needs of the UX design team.\n- Continuously improve the UX design team's processes and workflows.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and people management skills.\n- A deep understanding of the UX design process and the needs of UX designers.\n- Excellent coaching, mentoring, and facilitation skills.\n- Strong communication and interpersonal skills.\n- A passion for building and leading high-performing teams.\n- Experience as a UX designer is often a plus.\n"
  },
  {
    "role-name": "System Designer",
    "description": "A System Designer is a designer who specializes in the design of complex systems, such as game mechanics, economic models, or organizational processes. They are masters of complexity, with a deep understanding of how to design systems that are balanced, engaging, and resilient. They are passionate about creating systems that are both elegant and effective.\n",
    "industry": "Gaming, Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and document the rules, mechanics, and logic of complex systems.\n- Create and balance the parameters of a system to achieve a desired outcome.\n- Prototype and test systems to ensure that they are working as intended.\n- Collaborate with other designers, engineers, and stakeholders to integrate systems into a larger product or experience.\n- Stay current with the latest trends and best practices in system design.\n- Advocate for a systems-thinking approach to design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of systems thinking and complexity theory.\n- Expertise in a variety of modeling and simulation tools.\n- Strong analytical and mathematical skills.\n- Excellent communication and collaboration skills.\n- A passion for designing complex systems and a creative mindset.\n- A portfolio that demonstrates a strong ability to design and document complex systems.\n"
  },
  {
    "role-name": "Textile Designer",
    "description": "A Textile Designer is a creative professional who specializes in the design of knitted, woven, and printed fabrics. They are responsible for creating the patterns, colors, and textures that we see in a wide range of products, from fashion and home furnishings to automotive interiors and medical textiles. They are masters of the loom and the print screen, with a deep understanding of materials, manufacturing processes, and the history of textile design.\n",
    "industry": "Fashion, Interiors\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of textile designs, from initial sketch to final production.\n- Collaborate with clients, art directors, and other stakeholders to understand project goals and requirements.\n- Develop and execute textile design concepts from initial sketch to final production.\n- Stay current with the latest trends and techniques in textile design.\n- Prepare files for a variety of production processes, from digital printing to weaving.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of textile design, including pattern, color, and repeat.\n- Proficiency in design software, such as Adobe Illustrator and Photoshop, as well as specialized textile design software.\n- A strong portfolio that showcases a range of textile design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for textiles.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Accessibility Specialist",
    "description": "An Accessibility Specialist is a hands-on expert dedicated to ensuring digital products meet accessibility standards. They are responsible for testing, identifying, and providing solutions to accessibility issues. Working closely with designers and developers, they help ensure that websites, applications, and other digital content are usable by people with disabilities.\n",
    "industry": "Tech, Consulting\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Conduct thorough accessibility audits of websites and applications against standards like WCAG.\n- Perform manual and automated accessibility testing using various tools and assistive technologies.\n- Identify and document accessibility bugs with clear and actionable recommendations for remediation.\n- Provide technical guidance and support to developers on implementing accessible code (e.g., ARIA, semantic HTML).\n- Collaborate with designers to ensure UI/UX designs are accessible from the start.\n- Create and maintain accessibility documentation and best practice guides.\n- Participate in user research with people with disabilities.\n",
    "similar-to-other-roles": null,
    "skills": "- Deep understanding of WCAG 2.1/2.2 and other accessibility standards.\n- Proficiency with accessibility testing tools (e.g., Axe, WAVE, Lighthouse).\n- Hands-on experience with assistive technologies like JAWS, NVDA, VoiceOver, and TalkBack.\n- Strong knowledge of HTML, CSS, and JavaScript, particularly in relation to accessibility.\n- Familiarity with ARIA (Accessible Rich Internet Applications) and its proper implementation.\n- Excellent analytical and problem-solving skills.\n- Strong communication skills to effectively articulate accessibility issues and solutions.\n"
  },
  {
    "role-name": "Context Designer",
    "description": "A Context Designer is a specialist who focuses on understanding and designing for the broader context in which a product or service is used. They go beyond the screen to consider the user's physical, social, and emotional environment, as well as the technological and cultural factors that shape their experience. They are systems thinkers who design adaptive and responsive experiences that are tailored to the user's specific situation.\n",
    "industry": "IoT, Tech\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Conduct ethnographic research and contextual inquiry to understand the user's environment and behaviors.\n- Map the user's journey across different contexts, touchpoints, and channels.\n- Design experiences that adapt to the user's location, time of day, and other contextual factors.\n- Collaborate with designers, engineers, and data scientists to create context-aware products and services.\n- Prototype and test context-aware experiences.\n- Consider the ethical implications of collecting and using contextual data.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in qualitative research methods, such as ethnographic research and contextual inquiry.\n- Strong systems thinking and service design skills.\n- A deep understanding of the Internet of Things (IoT) and other emerging technologies.\n- Ability to think creatively and solve complex problems.\n- Strong communication and collaboration skills.\n- A passion for understanding human behavior in the real world.\n"
  },
  {
    "role-name": "Interior Designer",
    "description": "An Interior Designer is a creative professional who designs and creates functional and aesthetically pleasing interior spaces. They are experts in space planning, color theory, and materials, and they use that knowledge to create spaces that are not only beautiful, but also safe, comfortable, and efficient. They are passionate about creating spaces that enhance the lives of the people who use them.\n",
    "industry": "Architecture, Real Estate\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Develop and execute design concepts for a wide range of interior spaces, from residential to commercial.\n- Create detailed drawings, plans, and specifications for interior designs.\n- Select and specify furniture, fixtures, and materials.\n- Collaborate with architects, contractors, and other professionals to ensure that designs are implemented correctly.\n- Manage project budgets and timelines.\n- Stay current with the latest trends and best practices in interior design.\n",
    "similar-to-other-roles": null,
    "skills": "- A strong sense of style and a deep understanding of design principles.\n- Expertise in space planning, color theory, and materials.\n- Proficiency in design software, such as AutoCAD, Revit, or SketchUp.\n- Excellent communication, presentation, and project management skills.\n- A passion for creating beautiful and functional interior spaces.\n- A portfolio that showcases a strong ability to design and execute interior design projects.\n"
  },
  {
    "role-name": "3D Modeler",
    "description": "A 3D Modeler is a specialized artist who focuses on creating the geometry of three-dimensional objects. They translate 2D concept art and designs into detailed and accurate 3D models. These models form the foundation for animations, games, and visual effects, requiring a strong understanding of form, topology, and technical constraints.\n",
    "industry": "Gaming, Architecture, Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Interpret concept art and sketches to create accurate 3D models.\n- Create clean and efficient topology for models to ensure proper deformation in animation.\n- Sculpt high-resolution details for characters, creatures, and hard-surface models.\n- Create optimized, game-ready models with appropriate polygon counts.\n- Unwrap UVs and prepare models for texturing.\n- Collaborate with texture artists and riggers to ensure models are ready for the next stage of the production pipeline.\n- Maintain a consistent level of quality and style across all models.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in 3D modeling and sculpting software like ZBrush, Maya, 3ds Max, or Blender.\n- Strong understanding of polygonal and subdivision surface modeling techniques.\n- Proficiency in creating clean and efficient topology.\n- Excellent understanding of human and animal anatomy for character modeling.\n- Knowledge of hard-surface modeling techniques for creating vehicles, weapons, and props.\n- Familiarity with the 3D production pipeline.\n- Strong attention to detail and a keen eye for form and silhouette.\n"
  },
  {
    "role-name": "Ui Designer",
    "description": "A UI (User Interface) Designer is a creative professional who specializes in the design of the visual and interactive elements of a digital product. They are responsible for creating interfaces that are not only beautiful, but also intuitive, easy to use, and accessible. They are masters of the pixel, with a deep understanding of typography, color, and layout. They are passionate about creating user interfaces that are both elegant and effective.\n",
    "industry": "Tech, Agency\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of user interface elements, from buttons and icons to complex data visualizations.\n- Collaborate with UX designers, product managers, and engineers to create a cohesive and user-centered product.\n- Create and maintain a design system to ensure consistency and quality across all products.\n- Stay current with the latest trends and best practices in UI design.\n- Prepare and deliver design assets to the engineering team.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of visual design, including typography, color theory, and layout.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe XD.\n- A strong portfolio that showcases a range of UI design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for UI design.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Business Designer",
    "description": "A Business Designer is a strategic thinker who applies design methodologies to solve complex business challenges. They bridge the gap between business, technology, and design, using a human-centered approach to create innovative and viable business models, products, and services. They are focused on creating value for both customers and the business.\n",
    "industry": "Consulting, Innovation, Tech\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Apply design thinking and other innovation methodologies to identify and frame business opportunities.\n- Conduct market research, competitive analysis, and customer discovery to uncover unmet needs and insights.\n- Design and prototype new business models, value propositions, and revenue streams.\n- Develop financial models and business cases to assess the viability and potential impact of new ventures.\n- Facilitate workshops and collaborative sessions with cross-functional teams and stakeholders.\n- Create and test hypotheses through experiments and prototypes to validate business concepts.\n- Translate business strategy into actionable plans and roadmaps.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong foundation in business strategy, finance, and operations.\n- Proficiency in design thinking, service design, and other human-centered design methods.\n- Excellent analytical and problem-solving skills.\n- Experience with market research and data analysis.\n- Strong communication, facilitation, and storytelling abilities.\n- Ability to work in a collaborative, fast-paced, and ambiguous environment.\n- A creative and entrepreneurial mindset.\n"
  },
  {
    "role-name": "Head Of Research",
    "description": "A Head of Research is a senior leader who is responsible for the overall research vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing research teams. They are responsible for setting the bar for research excellence and for ensuring that the research team is generating insights that inform and inspire the design of products, services, and experiences.\n",
    "industry": "Tech\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the research vision and strategy for the organization.\n- Lead and mentor a team of researchers, providing guidance, feedback, and career development.\n- Oversee all research activities, ensuring a high standard of quality and rigor.\n- Collaborate with other leaders in design, product, and engineering to ensure that research is integrated into the entire product development process.\n- Champion a user-centered and data-informed culture throughout the organization.\n- Attract, hire, and retain top research talent.\n- Stay current with the latest trends and best practices in user research.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in a wide range of qualitative and quantitative research methods.\n- A compelling track record of generating and communicating user insights that have had a significant impact on product and business decisions.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing research teams.\n"
  },
  {
    "role-name": "Exhibition Designer",
    "description": "An Exhibition Designer is a creative professional who specializes in designing and creating immersive and engaging experiences for exhibitions, museums, trade shows, and other public spaces. They are storytellers who use a variety of design disciplines, from spatial and graphic design to interactive media, to communicate a message and create a memorable experience for visitors.\n",
    "industry": "Museums, Events\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Develop and execute the overall design concept for an exhibition.\n- Design the spatial layout and flow of the exhibition space.\n- Design and create custom displays, fixtures, and interactive installations.\n- Collaborate with curators, content developers, and other stakeholders to ensure a cohesive and compelling narrative.\n- Oversee the production and installation of all exhibition elements.\n- Manage the budget and timeline for the design and production of the exhibition.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong spatial and 3D design skills.\n- Proficiency in design software, such as SketchUp, AutoCAD, and Adobe Creative Suite.\n- A deep understanding of storytelling and narrative design.\n- Excellent communication, collaboration, and project management skills.\n- A passion for creating immersive and engaging experiences.\n- A portfolio that showcases a strong ability to design and execute exhibitions.\n"
  },
  {
    "role-name": "Set Designer",
    "description": "A Set Designer is a creative professional who is responsible for the design and creation of the sets for a variety of productions, including theater, film, and television. They are visual storytellers who use their artistic and technical skills to create the world in which the story takes place. They are passionate about creating immersive and believable environments that support the narrative and enhance the audience's experience.\n",
    "industry": "Theater, Film\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Collaborate with the director and other members of the creative team to develop a vision for the set design.\n- Create sketches, models, and other design artifacts to communicate the set design concept.\n- Produce detailed drawings and specifications for the construction of the set.\n- Oversee the construction and installation of the set.\n- Stay current with the latest trends and techniques in set design.\n- Manage the budget and timeline for the set design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of the principles of set design.\n- Expertise in a variety of design and drafting tools, such as AutoCAD, SketchUp, and Vectorworks.\n- Strong artistic and creative skills.\n- Excellent communication and collaboration skills.\n- A passion for storytelling and a creative mindset.\n- A portfolio that showcases a strong ability to design and execute set design projects.\n"
  },
  {
    "role-name": "Sustainability Designer",
    "description": "A Sustainability Designer is a creative professional who is committed to designing products, services, and systems that are environmentally and socially responsible. They are experts in sustainable design principles, with a deep understanding of the entire lifecycle of a product, from material extraction to end-of-life. They are passionate about creating a better future for people and the planet.\n",
    "industry": "Consulting, Manufacturing\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Design products, services, and systems that are environmentally and socially responsible.\n- Conduct life cycle assessments and other analyses to understand the environmental and social impact of designs.\n- Select and specify sustainable materials and manufacturing processes.\n- Collaborate with a wide range of stakeholders to integrate sustainability into the design process.\n- Stay current with the latest trends and best practices in sustainable design.\n- Advocate for a more sustainable and equitable future.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of sustainable design principles and practices.\n- Expertise in a variety of sustainable design tools and methodologies, such as life cycle assessment and cradle-to-cradle design.\n- Strong research, analysis, and synthesis skills.\n- Excellent communication and collaboration skills.\n- A passion for sustainability and a creative mindset.\n- A portfolio that demonstrates a strong commitment to sustainable design.\n"
  },
  {
    "role-name": "Brand Designer",
    "description": "A Brand Designer is a creative professional who specializes in creating and managing the visual identity of a brand. They are responsible for crafting the look and feel of a company, ensuring that all visual elements are consistent and aligned with the brand's message and values. They are the guardians of the brand's visual language, creating a strong and recognizable presence in the market.\n",
    "industry": "Agency, Tech, Consumer Goods\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and develop visual identity systems, including logos, color palettes, typography, and imagery.\n- Create and maintain comprehensive brand guidelines and style guides.\n- Design a wide range of marketing and communication materials, such as websites, social media assets, presentations, and print collateral.\n- Collaborate with marketing, product, and other teams to ensure brand consistency across all touchpoints.\n- Evolve and refresh the brand's visual identity as the company grows and changes.\n- Stay current with design trends and best practices in branding.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in graphic design principles, including typography, color theory, and layout.\n- Proficiency in design software like Adobe Illustrator, Photoshop, and InDesign.\n- A strong portfolio showcasing branding and visual identity projects.\n- Excellent communication and collaboration skills.\n- Strategic thinking and the ability to translate brand strategy into visual design.\n- Meticulous attention to detail and a passion for creating high-quality work.\n"
  },
  {
    "role-name": "Vp Of Ux",
    "description": "A VP of UX is a senior executive who is responsible for the overall user experience (UX) vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing UX teams. They are responsible for setting the bar for UX excellence and for ensuring that the UX team is creating products that are both user-friendly and valuable to the business. They are a key member of the executive team and play a critical role in shaping the company's strategy and culture.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the UX vision and strategy for the company.\n- Lead and mentor a team of UX directors and managers, providing guidance, feedback, and career development.\n- Oversee the UX of all products, ensuring a high standard of quality, consistency, and usability.\n- Collaborate with other executives to ensure that UX is integrated into the entire business.\n- Champion a user-centered design culture throughout the company.\n- Attract, hire, and retain top UX talent.\n- Manage the UX budget and resources.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in UX design, user research, and interaction design.\n- A compelling portfolio of work that demonstrates a commitment to UX excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing UX teams.\n"
  },
  {
    "role-name": "Head Of Ux",
    "description": "A Head of UX is a senior leader who is responsible for the overall user experience (UX) vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing UX teams. They are responsible for setting the bar for UX excellence and for ensuring that the UX team is creating products that are both user-friendly and valuable to the business.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the UX vision and strategy for the organization.\n- Lead and mentor a team of UX designers, researchers, and other UX professionals, providing guidance, feedback, and career development.\n- Oversee the UX of all products, ensuring a high standard of quality, consistency, and usability.\n- Collaborate with other leaders in product, engineering, and marketing to ensure a cohesive and integrated user experience.\n- Champion a user-centered design culture throughout the organization.\n- Attract, hire, and retain top UX talent.\n- Stay current with the latest trends and best practices in UX.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in UX design, user research, and interaction design.\n- A compelling portfolio of work that demonstrates a commitment to UX excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing UX teams.\n"
  },
  {
    "role-name": "Visual Designer",
    "description": "A Visual Designer is a creative professional who specializes in the design of the visual and interactive elements of a digital product. They are responsible for creating interfaces that are not only beautiful, but also intuitive, easy to use, and accessible. They are masters of the pixel, with a deep understanding of typography, color, and layout. They are passionate about creating user interfaces that are both elegant and effective.\n",
    "industry": "Tech, Agency\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of user interface elements, from buttons and icons to complex data visualizations.\n- Collaborate with UX designers, product managers, and engineers to create a cohesive and user-centered product.\n- Create and maintain a design system to ensure consistency and quality across all products.\n- Stay current with the latest trends and best practices in visual design.\n- Prepare and deliver design assets to the engineering team.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of visual design, including typography, color theory, and layout.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe XD.\n- A strong portfolio that showcases a range of visual design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for visual design.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Urban Designer",
    "description": "An Urban Designer is a creative professional who specializes in the design of cities, towns, and other urban areas. They are responsible for creating places that are not only beautiful, but also functional, sustainable, and equitable. They are masters of the urban realm, with a deep understanding of urban planning, architecture, and landscape architecture. They are passionate about creating great cities for people.\n",
    "industry": "Urban Planning, Gov\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of urban design projects, from master plans to streetscape designs.\n- Collaborate with community members, government agencies, and other stakeholders to understand the needs and aspirations of the community.\n- Develop and execute urban design concepts from initial sketch to final implementation.\n- Stay current with the latest trends and best practices in urban design.\n- Prepare and present design concepts to clients and the public.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in urban design, urban planning, and landscape architecture.\n- Proficiency in design software, such as AutoCAD, SketchUp, and Adobe Creative Suite.\n- A strong portfolio that showcases a range of urban design skills and a commitment to quality.\n- Excellent communication, collaboration, and community engagement skills.\n- A creative mindset and a passion for creating great cities.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Design Educator",
    "description": "A Design Educator is a design professional who is passionate about teaching and sharing their knowledge with others. They work in a variety of settings, from universities and colleges to corporate training programs and online learning platforms. They are dedicated to helping the next generation of designers develop the skills, knowledge, and mindset they need to succeed in the field.\n",
    "industry": "Education, Tech\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Develop and deliver engaging and effective design curriculum and course materials.\n- Teach a variety of design subjects, such as design history, theory, and practice.\n- Provide students with feedback and guidance on their work.\n- Mentor and advise students on their career paths.\n- Stay current with the latest trends and best practices in design and design education.\n- Contribute to the design community through writing, speaking, and other activities.\n",
    "similar-to-other-roles": null,
    "skills": "- Deep expertise in a variety of design disciplines.\n- Strong teaching and presentation skills.\n- A passion for sharing knowledge and helping others learn.\n- Excellent communication and interpersonal skills.\n- A patient and empathetic approach to teaching.\n- Experience in the design industry is often a plus.\n"
  },
  {
    "role-name": "Accessibility Lead",
    "description": "An Accessibility Lead is a leader and advocate responsible for driving the accessibility strategy and initiatives within an organization. They ensure that products, services, and digital experiences are usable by people with a wide range of disabilities. This role involves a combination of hands-on testing, team education, strategic planning, and evangelism to embed accessibility into the company's culture and processes.\n",
    "industry": "Tech, Government, Agency\n",
    "medium": "Digital\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Develop and implement the organization's accessibility strategy and roadmap.\n- Lead and mentor a team of accessibility specialists and champions.\n- Establish and enforce accessibility standards and guidelines, such as WCAG.\n- Conduct accessibility audits and provide recommendations for remediation.\n- Collaborate with design, engineering, and product teams to integrate accessibility into the entire product development lifecycle.\n- Develop and deliver accessibility training and resources to empower teams.\n- Stay up-to-date with the latest accessibility standards, technologies, and best practices.\n- Represent the company's commitment to accessibility to external stakeholders.\n",
    "similar-to-other-roles": null,
    "skills": "- Expert knowledge of accessibility standards, including WCAG 2.1/2.2, Section 508, and ADA.\n- Experience with a variety of assistive technologies (e.g., screen readers, screen magnifiers, voice recognition software).\n- Strong leadership, communication, and interpersonal skills.\n- Ability to influence and drive change across different teams and departments.\n- Experience with accessibility testing tools and methodologies.\n- Understanding of inclusive design principles.\n- Passion for creating accessible and inclusive digital experiences.\n"
  },
  {
    "role-name": "Design Coach",
    "description": "A Design Coach is an experienced design professional who is dedicated to helping individuals and teams grow their design skills and capabilities. They are a mentor, a facilitator, and a guide, with a passion for helping others reach their full potential. They work with designers at all levels, from junior to senior, to help them improve their craft, their process, and their impact.\n",
    "industry": "Consulting, Education\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Provide one-on-one coaching and mentoring to designers.\n- Facilitate workshops and training sessions on a variety of design topics, such as design thinking, user research, and prototyping.\n- Help design teams improve their processes and workflows.\n- Facilitate design sprints and other collaborative design activities.\n- Provide feedback and guidance on design work.\n- Help designers develop their careers and achieve their professional goals.\n",
    "similar-to-other-roles": null,
    "skills": "- Deep expertise in a variety of design disciplines, such as UX design, service design, or product design.\n- Strong coaching, mentoring, and facilitation skills.\n- Excellent communication and interpersonal skills.\n- A passion for helping others learn and grow.\n- A patient and empathetic approach to coaching.\n- Experience in a senior design role is often a plus.\n"
  },
  {
    "role-name": "Circular Designer",
    "description": "A Circular Designer is a forward-thinking professional who designs products, services, and systems based on the principles of the circular economy. Their goal is to eliminate waste and pollution, keep products and materials in use for as long as possible, and regenerate natural systems. They rethink the entire lifecycle of a product, from material selection to end-of-life, to create a more sustainable and restorative future.\n",
    "industry": "Manufacturing, Sustainability\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Design products for durability, repairability, disassembly, and recyclability (Design for X).\n- Research and select sustainable, renewable, and non-toxic materials.\n- Conduct life cycle assessments (LCA) to understand the environmental impact of products and materials.\n- Develop closed-loop systems and business models, such as product-as-a-service or take-back programs.\n- Collaborate with engineers, supply chain specialists, and business strategists to implement circular design principles.\n- Educate and advocate for circular design within the organization.\n",
    "similar-to-other-roles": null,
    "skills": "- Deep understanding of circular economy principles and frameworks.\n- Strong knowledge of sustainable materials and manufacturing processes.\n- Experience with life cycle assessment (LCA) and other environmental impact assessment tools.\n- Systems thinking and the ability to see the bigger picture.\n- Creativity and a passion for sustainable innovation.\n- Strong collaboration and communication skills.\n- Knowledge of sustainable business models.\n"
  },
  {
    "role-name": "Place Designer",
    "description": "A Place Designer is a creative professional who specializes in the design of public spaces, from parks and plazas to streetscapes and waterfronts. They are responsible for creating places that are not only beautiful, but also functional, sustainable, and inclusive. They are masters of the public realm, with a deep understanding of urban design, landscape architecture, and community engagement.\n",
    "industry": "Urban Planning, Real Estate\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of public spaces, from master plans to detailed designs.\n- Collaborate with community members, government agencies, and other stakeholders to understand the needs and aspirations of the community.\n- Develop and execute placemaking strategies to activate and energize public spaces.\n- Stay current with the latest trends and best practices in urban design and placemaking.\n- Prepare and present design concepts to clients and the public.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in urban design, landscape architecture, and placemaking.\n- Proficiency in design software, such as AutoCAD, SketchUp, and Adobe Creative Suite.\n- A strong portfolio that showcases a range of place design skills and a commitment to quality.\n- Excellent communication, collaboration, and community engagement skills.\n- A creative mindset and a passion for creating great places.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Packaging Designer",
    "description": "A Packaging Designer is a creative professional who specializes in the design of packaging for a wide range of products. They are responsible for creating packaging that is not only visually appealing, but also functional, manufacturable, and sustainable. They are masters of the three-dimensional canvas, with a deep understanding of materials, printing processes, and the psychology of consumer behavior.\n",
    "industry": "FMCG, Retail\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of packaging, from food and beverage packaging to consumer electronics packaging.\n- Collaborate with clients, marketers, and other stakeholders to understand project goals and requirements.\n- Develop and execute packaging design concepts from initial sketch to final production.\n- Stay current with the latest trends and best practices in packaging design.\n- Prepare files for print production.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in graphic design principles, including typography, color theory, and layout.\n- Proficiency in design software, such as Adobe Creative Suite (Illustrator, Photoshop, InDesign).\n- A strong portfolio that showcases a range of packaging design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for packaging.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Cx Architect",
    "description": "A CX Architect, or Customer Experience Architect, is a strategic designer who is responsible for the overall structure and design of the customer experience ecosystem. They take a holistic view of the customer journey, mapping out all the touchpoints and interactions a customer has with a company. They are systems thinkers who design the blueprint for a seamless, consistent, and delightful customer experience.\n",
    "industry": "Enterprise, Tech\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Map and analyze the end-to-end customer journey across all channels and touchpoints.\n- Design and develop a comprehensive CX architecture that aligns with the company's brand and business goals.\n- Identify and prioritize key opportunities for improving the customer experience.\n- Collaborate with product, marketing, sales, and support teams to ensure a cohesive and integrated customer experience.\n- Develop and maintain service blueprints, journey maps, and other CX design artifacts.\n- Establish and govern CX standards and guidelines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in service design, systems thinking, and user experience design.\n- Strong analytical and strategic thinking skills.\n- A deep understanding of the customer journey and the factors that influence customer satisfaction and loyalty.\n- Excellent communication, collaboration, and facilitation skills.\n- Experience with CX design tools and methodologies, such as service blueprints and journey mapping.\n- A passion for creating seamless and customer-centric experiences.\n"
  },
  {
    "role-name": "TillgaNglighets Lead",
    "description": "En Tillgnglighetslead r en ledare och fresprkare som ansvarar fr att driva tillgnglighetsstrategin och initiativen inom en organisation. De skerstller att produkter, tjnster och digitala upplevelser r anvndbara fr personer med en mngd olika funktionsnedsttningar. Denna roll innebr en kombination av praktisk testning, teamutbildning, strategisk planering och evangelism fr att bdda in tillgnglighet i fretagets kultur och processer.\n",
    "industry": "Tech, Gov\n",
    "medium": "Digital\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Utveckla och implementera organisationens tillgnglighetsstrategi och frdplan.\n- Leda och mentorera ett team av tillgnglighetsspecialister och fresprkare.\n- Etablera och upprtthlla tillgnglighetsstandarder och riktlinjer, ssom WCAG.\n- Genomfra tillgnglighetsrevisioner och ge rekommendationer fr tgrder.\n- Samarbeta med design-, ingenjrs- och produktteam fr att integrera tillgnglighet i hela produktutvecklingslivscykeln.\n- Utveckla och leverera tillgnglighetsutbildning och resurser fr att strka teamen.\n- Hlla sig uppdaterad med de senaste tillgnglighetsstandarderna, teknikerna och bsta praxis.\n- Representera fretagets engagemang fr tillgnglighet fr externa intressenter.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertkunskap om tillgnglighetsstandarder, inklusive WCAG 2.1/2.2, Section 508 och ADA.\n- Erfarenhet av en mngd olika hjlpmedelstekniker (t.ex. skrmlsare, skrmfrstorare, rstigenknningsprogram).\n- Starkt ledarskap, kommunikation och sociala frdigheter.\n- Frmga att pverka och driva frndring ver olika team och avdelningar.\n- Erfarenhet av tillgnglighetstestverktyg och metoder.\n- Frstelse fr inkluderande designprinciper.\n- Passion fr att skapa tillgngliga och inkluderande digitala upplevelser.\n"
  },
  {
    "role-name": "Industrial Designer",
    "description": "An Industrial Designer is a creative professional who designs the physical products that we use every day, from cars and furniture to consumer electronics and medical devices. They are problem-solvers who use their skills in design, engineering, and art to create products that are not only beautiful, but also functional, manufacturable, and user-friendly. They are passionate about creating products that improve people's lives.\n",
    "industry": "Manufacturing, Tech\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Develop and sketch a wide range of product concepts.\n- Create detailed 3D models and renderings of product designs.\n- Build and test physical prototypes to evaluate the form, function, and ergonomics of designs.\n- Collaborate with engineers, marketers, and other stakeholders to ensure that product designs are both innovative and manufacturable.\n- Select and specify materials and finishes for products.\n- Stay current with the latest trends and technologies in industrial design.\n",
    "similar-to-other-roles": null,
    "skills": "- Exceptional sketching and 3D modeling skills.\n- A deep understanding of form, function, and ergonomics.\n- Expertise in 3D modeling and rendering software, such as SolidWorks, Rhino, or KeyShot.\n- A strong sense of aesthetics and a passion for creating beautiful and innovative products.\n- Excellent communication and collaboration skills.\n- A portfolio that showcases a strong ability to create compelling and innovative product designs.\n"
  },
  {
    "role-name": "Innovation Manager",
    "description": "An Innovation Manager is a leader who is responsible for the overall innovation process and portfolio for a company. They are a coach, a mentor, and a facilitator, with a passion for helping the innovation team do their best work. They are responsible for creating a supportive and collaborative environment where the innovation team can learn, grow, and thrive.\n",
    "industry": "Enterprise\n",
    "medium": "Service\n",
    "org-level": "Manager\n",
    "responsibilities": "- Manage a team of innovators, including hiring, onboarding, performance reviews, and career development.\n- Provide coaching, mentorship, and guidance to the innovation team.\n- Foster a positive and inclusive team culture.\n- Manage the team's workload and resources.\n- Facilitate communication and collaboration within the innovation team and with other departments.\n- Advocate for the needs of the innovation team.\n- Continuously improve the innovation team's processes and workflows.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and people management skills.\n- A deep understanding of the innovation process and the needs of innovators.\n- Excellent coaching, mentoring, and facilitation skills.\n- Strong communication and interpersonal skills.\n- A passion for building and leading high-performing teams.\n- Experience in an innovation role is often a plus.\n"
  },
  {
    "role-name": "Concept Development Manager",
    "description": "A Concept Development Manager is a strategic leader who oversees the fuzzy front end of the innovation process. They are responsible for managing the journey of a new idea, from initial spark to a fully validated concept ready for development. They create the conditions for creativity and collaboration, while also bringing a structured and disciplined approach to the often-chaotic process of innovation.\n",
    "industry": "Retail, FMCG\n",
    "medium": "Service\n",
    "org-level": "Manager\n",
    "responsibilities": "- Lead and facilitate ideation and brainstorming workshops to generate a strong pipeline of new ideas.\n- Develop and manage a process for evaluating, prioritizing, and selecting the most promising concepts.\n- Lead cross-functional teams in the development and validation of new concepts.\n- Oversee the creation of prototypes, mockups, and other tools to test and learn about new concepts.\n- Manage the budget, timeline, and resources for concept development projects.\n- Collaborate with R&D, marketing, and sales to ensure that new concepts are desirable, feasible, and viable.\n- Present and pitch new concepts to senior leadership for funding and approval.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Expertise in innovation methodologies, such as design thinking, lean startup, and jobs-to-be-done.\n- Excellent facilitation and communication skills.\n- Strong strategic thinking and business acumen.\n- Experience with project management and a proven ability to deliver results.\n- A passion for innovation and a creative mindset.\n- Ability to navigate ambiguity and uncertainty.\n"
  },
  {
    "role-name": "Accessibility Strategist",
    "description": "An Accessibility Strategist focuses on the big picture, developing and implementing long-term strategies to embed accessibility into the core of an organization's culture, processes, and products. They work at a systemic level to ensure that accessibility is not just a checklist item but a fundamental aspect of how the organization operates.\n",
    "industry": "Tech, Enterprise\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Develop and champion a company-wide accessibility vision and strategy.\n- Create and implement accessibility policies, standards, and governance models.\n- Design and oversee the rollout of accessibility training and awareness programs across the organization.\n- Establish key metrics and KPIs to measure the progress and impact of accessibility initiatives.\n- Collaborate with leadership to secure buy-in and resources for accessibility.\n- Identify and mitigate accessibility-related risks.\n- Foster a culture of accessibility and inclusion throughout the organization.\n- Engage with legal and compliance teams to ensure adherence to accessibility laws and regulations.\n",
    "similar-to-other-roles": null,
    "skills": "- Proven experience in developing and implementing strategic initiatives.\n- Strong understanding of accessibility principles and standards.\n- Excellent leadership, communication, and influencing skills.\n- Experience with change management and driving cultural transformation.\n- Ability to work effectively with senior stakeholders and executive leadership.\n- Strong analytical skills to measure the business impact of accessibility.\n- Knowledge of accessibility laws and regulations.\n"
  },
  {
    "role-name": "Surface Designer",
    "description": "A Surface Designer is a creative professional who specializes in the design of patterns, textures, and other surface treatments for a wide range of products, from textiles and wallpaper to ceramics and stationery. They are masters of the two-dimensional canvas, with a deep understanding of color, pattern, and repeat. They are passionate about creating beautiful and unique surfaces that bring joy to everyday life.\n",
    "industry": "Textiles, Interiors\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of surface patterns and textures.\n- Collaborate with clients, art directors, and other stakeholders to understand project goals and requirements.\n- Develop and execute surface design concepts from initial sketch to final production.\n- Stay current with the latest trends and techniques in surface design.\n- Prepare files for a variety of production processes, from digital printing to screen printing.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of pattern design, including repeat, color, and scale.\n- Proficiency in design software, such as Adobe Illustrator and Photoshop.\n- A strong portfolio that showcases a range of surface design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for surface design.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Conversation Designer",
    "description": "A Conversation Designer is a user experience professional who specializes in designing the interactions for chatbots, voice assistants, and other conversational AI systems. They are the architects of the conversation, crafting the flow, logic, and personality of the AI to create a natural, intuitive, and engaging user experience. They are part writer, part designer, and part linguist, with a deep understanding of how humans communicate.\n",
    "industry": "Tech, AI\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and write the dialogue and conversational flows for chatbots and voice assistants.\n- Define the persona, tone of voice, and personality of the conversational AI.\n- Create user journey maps, conversation flows, and other design artifacts.\n- Collaborate with developers and data scientists to train and improve the AI's natural language understanding (NLU).\n- Conduct user research and usability testing to gather feedback and iterate on the conversational experience.\n- Stay current with the latest trends and best practices in conversational AI.\n",
    "similar-to-other-roles": null,
    "skills": "- Exceptional writing, editing, and communication skills.\n- A deep understanding of user experience (UX) and user-centered design principles.\n- Knowledge of linguistics and the principles of human conversation.\n- Experience with conversational design tools and platforms.\n- Strong analytical and problem-solving skills.\n- A passion for creating natural and engaging conversational experiences.\n- A portfolio that demonstrates a strong understanding of conversational design.\n"
  },
  {
    "role-name": "Ux Engineer",
    "description": "A UX Engineer is a front-end developer who specializes in the implementation of user interfaces with a focus on user experience. They are a hybrid of a designer and a developer, with a deep understanding of both design principles and front-end technologies. They are passionate about creating user interfaces that are not only beautiful and functional, but also performant, accessible, and easy to use.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Translate design mockups and prototypes into high-quality, production-ready code.\n- Build and maintain reusable UI components and design systems.\n- Collaborate with designers to create and prototype new user experiences.\n- Ensure that the front-end of the product is accessible, performant, and responsive.\n- Stay current with the latest trends and best practices in front-end development and UX.\n- Act as a bridge between the design and engineering teams, helping to foster a collaborative and user-centered culture.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in front-end technologies, such as HTML, CSS, and JavaScript.\n- Experience with modern JavaScript frameworks, such as React, Vue, or Angular.\n- A strong understanding of design principles, including typography, color, and layout.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe XD.\n- A passion for creating beautiful and user-friendly interfaces.\n- Excellent communication and collaboration skills.\n- A portfolio that showcases a strong ability to bridge the gap between design and engineering.\n"
  },
  {
    "role-name": "Experience Lead",
    "description": "An Experience Lead is a senior-level professional who is responsible for leading and guiding a team of experience designers and researchers. They are a player-coach who is both a skilled experience design practitioner and a mentor to others. They are responsible for setting the vision and direction for the experience design team, and for ensuring that the team is delivering high-quality work that meets the needs of both users and the business.\n",
    "industry": "Tech, Agency\n",
    "medium": "Digital\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead and mentor a team of experience designers and researchers.\n- Develop and implement an experience design strategy that is aligned with the company's business goals.\n- Oversee the design and execution of experience design projects from concept to completion.\n- Champion a human-centered design culture throughout the organization.\n- Collaborate with product, engineering, and other teams to ensure a cohesive and consistent user experience.\n- Establish and track key experience design metrics to measure the success of the team's work.\n- Stay current with the latest trends and best practices in experience design.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Expertise in experience design, user research, and interaction design.\n- Excellent communication, presentation, and facilitation skills.\n- A data-driven mindset and a focus on results.\n- A passion for building and mentoring high-performing teams.\n- A strong portfolio that demonstrates a deep understanding of experience design and a track record of success.\n"
  },
  {
    "role-name": "Ui Lead",
    "description": "A UI (User Interface) Lead is a senior UI professional who is responsible for the UI design of a specific product, project, or team. They are a hands-on leader who is both a skilled UI designer and a mentor to other designers. They are responsible for ensuring that the UI work is aligned with the project's goals, and for guiding the team to create a high-quality, user-centered experience.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead the UI design of a specific product, project, or feature from concept to completion.\n- Provide guidance, feedback, and mentorship to other UI designers on the team.\n- Collaborate with product managers, engineers, and other stakeholders to ensure a cohesive and user-centered product.\n- Facilitate design critiques and reviews to ensure a high standard of quality.\n- Advocate for the user and for UI best practices.\n- Contribute to the development of the UI team's culture and processes.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in UI design, visual design, and interaction design.\n- Strong leadership and mentoring skills.\n- Excellent communication, collaboration, and presentation skills.\n- A passion for creating high-quality, user-centered experiences.\n- A strong portfolio that demonstrates a deep understanding of the UI design process and a track record of success.\n- Ability to provide and receive constructive feedback.\n"
  },
  {
    "role-name": "Illustrator",
    "description": "An Illustrator is a creative professional who creates original artwork for a variety of media, including books, magazines, websites, and advertising. They are visual storytellers who use their artistic skills to communicate ideas, emotions, and narratives. They are passionate and creative individuals, with a strong sense of style and a deep understanding of the principles of art and design.\n",
    "industry": "Publishing, Media, Agency\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Create original illustrations for a variety of projects, from editorial illustrations to book covers and advertising campaigns.\n- Collaborate with clients, art directors, and other stakeholders to understand project goals and requirements.\n- Develop and execute illustration concepts from initial sketch to final artwork.\n- Stay current with the latest trends and techniques in illustration.\n- Prepare files for print and digital production.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Exceptional drawing and painting skills, in both traditional and digital media.\n- A strong sense of style and a unique artistic voice.\n- Proficiency in illustration software, such as Adobe Illustrator, Photoshop, or Procreate.\n- A strong portfolio that showcases a range of illustration skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for illustration.\n"
  },
  {
    "role-name": "Service Designer",
    "description": "A Service Designer is a human-centered design professional who is responsible for the design of end-to-end services. They are systems thinkers who are passionate about creating services that are not only user-friendly, but also efficient, effective, and valuable to the business. They are experts in understanding the needs of both users and the organization, and in designing services that meet those needs.\n",
    "industry": "Service, Tech, Gov\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Conduct user research to understand the needs, behaviors, and pain points of users.\n- Create service blueprints, journey maps, and other design artifacts to visualize the end-to-end service experience.\n- Design and prototype new and improved services.\n- Collaborate with a wide range of stakeholders to bring service designs to life.\n- Facilitate workshops and collaborative design sessions.\n- Stay current with the latest trends and best practices in service design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of service design principles and methodologies.\n- Expertise in user research, systems thinking, and workshop facilitation.\n- Strong empathy and a passion for understanding the needs of users.\n- Excellent communication, collaboration, and storytelling skills.\n- Proficiency in a variety of design and research tools.\n- A portfolio that demonstrates a strong understanding of service design and a commitment to creating great user experiences.\n"
  },
  {
    "role-name": "Head Of Innovation",
    "description": "A Head of Innovation is a senior leader who is responsible for fostering a culture of innovation and driving the development of new products, services, and business models. They are tasked with managing the process of innovation, from ideation and experimentation to implementation and scaling. The Head of Innovation is a catalyst for change and a champion of new ideas.\n",
    "industry": "Enterprise, Consulting\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and lead the company's innovation strategy and portfolio.\n- Foster a culture that encourages creativity, experimentation, and risk-taking.\n- Establish and manage an innovation pipeline, from sourcing ideas to launching new ventures.\n- Identify and explore emerging technologies, trends, and business models.\n- Build and maintain relationships with external partners, such as startups, universities, and research labs.\n- Lead and mentor a team of innovation professionals.\n- Secure funding and resources for innovation projects.\n",
    "similar-to-other-roles": null,
    "skills": "- Proven experience in innovation management, corporate venturing, or a related field.\n- Strong strategic thinking and business acumen.\n- A deep understanding of innovation methodologies, such as design thinking, lean startup, and open innovation.\n- Excellent leadership, communication, and influencing skills.\n- A passion for exploring new ideas and challenging the status quo.\n- Ability to thrive in a fast-paced, ambiguous, and dynamic environment.\n"
  },
  {
    "role-name": "Ux Architect",
    "description": "A UX Architect is a user experience professional who specializes in the design of the underlying structure and flow of a digital product. They are responsible for creating a logical and intuitive user experience by focusing on the organization, navigation, and labeling of content. They are passionate about creating user experiences that are both easy and enjoyable to use.\n",
    "industry": "Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create the information architecture, navigation, and user flows for a digital product.\n- Create wireframes, sitemaps, and other design artifacts to communicate the UX architecture.\n- Collaborate with UX designers, UI designers, and other stakeholders to create a cohesive and user-centered product.\n- Conduct user research and usability testing to validate and iterate on the UX architecture.\n- Stay current with the latest trends and best practices in UX architecture.\n- Advocate for a user-centered and iterative approach to design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of UX architecture principles and best practices.\n- Expertise in a variety of design and prototyping tools, such as Figma, Sketch, or Axure.\n- Strong analytical and problem-solving skills.\n- Excellent communication and collaboration skills.\n- A passion for creating intuitive and engaging user experiences.\n- A portfolio that demonstrates a strong ability to design and document complex UX architectures.\n"
  },
  {
    "role-name": "Vibe Coder",
    "description": "A Vibe Coder is a creative coder who specializes in the creation of atmospheric and emotionally resonant experiences. They are a hybrid of a programmer and an artist, with a deep understanding of how to use code to create mood, feeling, and a sense of place. They are passionate about using technology to create immersive and evocative experiences that go beyond the purely functional.\n",
    "industry": "Music, Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and develop interactive and generative art installations.\n- Create real-time visual effects for music, performance, and other live events.\n- Collaborate with artists, musicians, and other creatives to bring their visions to life.\n- Experiment with new and emerging technologies to create novel and innovative experiences.\n- Stay current with the latest trends and techniques in creative coding and generative art.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in a variety of creative coding frameworks and languages, such as TouchDesigner, Processing, or openFrameworks.\n- A strong sense of aesthetics and a passion for creating beautiful and evocative experiences.\n- Excellent problem-solving and collaboration skills.\n- A creative mindset and a passion for experimentation.\n- A portfolio that showcases a strong ability to use code to create atmospheric and emotionally resonant experiences.\n"
  },
  {
    "role-name": "Director Of Product Design",
    "description": "A Director of Product Design is a senior leader who is responsible for the overall product design vision, strategy, and execution for a company or a product line. They are a visionary and a mentor, with a passion for building and leading high-performing product design teams. They are responsible for setting the bar for product design excellence and for ensuring that the design team is creating products that are both user-friendly and valuable to the business.\n",
    "industry": "Tech, SaaS\n",
    "medium": "Digital\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the product design vision and strategy.\n- Lead and mentor a team of product designers and design managers, providing guidance, feedback, and career development.\n- Oversee the design of all products, ensuring a high standard of quality, consistency, and user-friendliness.\n- Collaborate with other leaders in product, engineering, and marketing to ensure a cohesive and integrated product experience.\n- Champion a user-centered and data-informed design culture.\n- Attract, hire, and retain top product design talent.\n- Stay current with the latest trends and best practices in product design.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in product design, UX design, and user research.\n- A compelling portfolio of work that demonstrates a commitment to product design excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing product design teams.\n"
  },
  {
    "role-name": "Informations Arkitekt",
    "description": "En Informationsarkitekt r en UX-specialist som fokuserar p att organisera, strukturera och mrka upp innehll p ett stt som r ltt att hitta och frst. De r arkitekterna av informationsrymden och skapar ritningarna fr webbplatser, applikationer och andra digitala produkter. De brinner fr att skapa ordning i kaos och skapa en smls och intuitiv upplevelse fr anvndarna.\n",
    "industry": "Tech, Gov\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Analysera anvndarnas behov och beteenden fr att frst hur de sker efter och anvnder information.\n- Designa och skapa informationsarkitekturer, inklusive webbplatskartor, navigeringssystem och taxonomier.\n- Genomfra kortsortering, trdtestning och andra anvndarunderskningsmetoder fr att validera informationsarkitekturer.\n- Samarbeta med UX-designers, innehllsstrateger och andra intressenter fr att skapa en sammanhngande och anvndarcentrerad upplevelse.\n- Hlla sig uppdaterad med de senaste trenderna och bsta praxis inom informationsarkitektur.\n- Fresprka en tydlig och konsekvent informationsarkitektur ver alla digitala produkter.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertis inom principer och bsta praxis fr informationsarkitektur.\n- En djup frstelse fr anvndarcentrerad design och anvndarunderskningar.\n- Starka analytiska och systemtnkande frdigheter.\n- Utmrkta kommunikations- och samarbetsfrdigheter.\n- Erfarenhet av en mngd olika IA-verktyg och metoder, ssom kortsortering, trdtestning och webbplatskartlggning.\n- En portflj som visar en stark frmga att organisera och strukturera komplex information.\n"
  },
  {
    "role-name": "Innovation Strategist",
    "description": "An Innovation Strategist is a forward-thinking professional who is responsible for developing and executing the innovation strategy for a company. They are experts in identifying and capitalizing on new growth opportunities, from new products and services to new business models and markets. They are analytical and creative thinkers, with a passion for using innovation to drive business results.\n",
    "industry": "Consulting\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Develop and execute a comprehensive innovation strategy that is aligned with the company's business goals.\n- Conduct research and analysis to identify trends, opportunities, and threats in the market.\n- Develop and manage a portfolio of innovation projects.\n- Identify and evaluate new and emerging technologies and business models.\n- Collaborate with other teams to ensure that innovation is integrated into the entire product development process.\n- Communicate the innovation strategy to stakeholders at all levels of the organization.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in innovation strategy and management.\n- Strong analytical and strategic thinking skills.\n- Excellent communication, presentation, and interpersonal skills.\n- A passion for innovation and a deep understanding of the latest trends and technologies.\n- A strategic and creative mindset.\n- Experience with a variety of innovation tools and methodologies.\n"
  },
  {
    "role-name": "Strategic Transformation Manager",
    "description": "A Strategic Transformation Manager is a leader who is responsible for planning, executing, and managing large-scale organizational change initiatives. They are experts in change management, with a deep understanding of how to lead people and organizations through times of transition. They are passionate about helping organizations adapt and thrive in a rapidly changing world.\n",
    "industry": "Consulting, Enterprise\n",
    "medium": "Service\n",
    "org-level": "Manager\n",
    "responsibilities": "- Develop and execute a comprehensive change management strategy for large-scale transformation initiatives.\n- Collaborate with senior leaders to build alignment and buy-in for the change.\n- Develop and deliver communications and training to support the change.\n- Identify and mitigate risks and resistance to the change.\n- Measure and track the progress and impact of the change.\n- Stay current with the latest trends and best practices in change management.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in change management principles and methodologies.\n- Strong project and program management skills.\n- Excellent communication, facilitation, and influencing skills.\n- A deep understanding of organizational dynamics and culture.\n- A passion for helping people and organizations navigate change.\n- Experience in a senior change management role.\n"
  },
  {
    "role-name": "Service Design Lead",
    "description": "A Service Design Lead is a senior service design professional who is responsible for leading a team of service designers and for the overall quality of the service design work. They are a player-coach who is both a skilled service designer and a mentor to others. They are responsible for setting the vision and direction for the service design team, and for ensuring that the team is delivering high-quality work that meets the needs of both users and the business.\n",
    "industry": "Service, Gov\n",
    "medium": "Service\n",
    "org-level": "Craft Lead\n",
    "responsibilities": "- Lead and mentor a team of service designers, providing guidance, feedback, and career development.\n- Develop and implement a service design strategy that is aligned with the company's business goals.\n- Oversee the execution of service design projects from concept to completion.\n- Champion a human-centered and systems-thinking approach to service design.\n- Collaborate with other teams to ensure that service design is integrated into the entire product development process.\n- Establish and track key service design metrics to measure the success of the team's work.\n- Stay current with the latest trends and best practices in service design.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Expertise in service design, systems thinking, and user research.\n- Excellent communication, presentation, and facilitation skills.\n- A data-driven mindset and a focus on results.\n- A passion for building and mentoring high-performing teams.\n- A strong track record of success in leading service design projects.\n"
  },
  {
    "role-name": "Presentation Designer",
    "description": "A Presentation Designer is a creative professional who specializes in the design of high-impact presentations. They are responsible for creating presentations that are not only visually appealing, but also clear, concise, and persuasive. They are masters of visual storytelling, with a deep understanding of how to use design to communicate complex ideas and to move an audience to action.\n",
    "industry": "Consulting, Corporate\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of presentations, from sales pitches and investor decks to keynote addresses and conference presentations.\n- Collaborate with subject matter experts, executives, and other stakeholders to understand the goals and content of the presentation.\n- Develop and execute a clear and compelling narrative for each presentation.\n- Stay current with the latest trends and best practices in presentation design.\n- Prepare and deliver presentations in a variety of formats, from PowerPoint and Keynote to Google Slides and Prezi.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in presentation design principles, including typography, color theory, and layout.\n- Proficiency in presentation software, such as PowerPoint, Keynote, or Google Slides.\n- A strong portfolio that showcases a range of presentation design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for storytelling.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Ai Designer",
    "description": "An AI Designer specializes in creating intuitive and effective user experiences for products and services powered by artificial intelligence. This role bridges the gap between human-computer interaction and machine learning, focusing on how users interact with, understand, and trust AI systems. They design the behavior, personality, and conversational flows of AI, ensuring a seamless and human-centered experience.\n",
    "industry": "Tech, Innovation\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and map out human-AI interaction flows, including conversational interfaces, voice interactions, and visual feedback.\n- Define the personality, tone of voice, and behavioral guidelines for AI systems to ensure a consistent and engaging user experience.\n- Create wireframes, prototypes, and user journey maps for AI-driven features.\n- Collaborate with data scientists and machine learning engineers to understand the capabilities and limitations of AI models.\n- Conduct user research and usability testing to gather feedback and iterate on AI-powered features.\n- Address the ethical implications of AI, including bias, transparency, and user privacy in the design process.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong background in user experience (UX) and interaction design.\n- Understanding of fundamental AI and machine learning concepts.\n- Experience designing for voice user interfaces (VUI) and conversational AI.\n- Proficiency in prototyping tools like Figma, Sketch, or Adobe XD.\n- Knowledge of ethical AI principles and responsible design practices.\n- Excellent communication and collaboration skills to work effectively with cross-functional teams.\n- Ability to translate complex technical concepts into user-friendly designs.\n"
  },
  {
    "role-name": "Director Of Service Design",
    "description": "A Director of Service Design is a senior leader who is responsible for the overall service design vision, strategy, and execution for a company. They are a visionary and a mentor, with a passion for building and leading high-performing service design teams. They are responsible for setting the bar for service design excellence and for ensuring that the service design team is creating end-to-end service experiences that are both user-friendly and valuable to the business.\n",
    "industry": "Service, Finance, Gov\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the service design vision and strategy for the organization.\n- Lead and mentor a team of service designers, providing guidance, feedback, and career development.\n- Oversee the design of all service experiences, ensuring a high standard of quality, consistency, and user-friendliness.\n- Collaborate with other leaders in product, marketing, and operations to ensure a cohesive and integrated service experience.\n- Champion a human-centered and systems-thinking approach to service design.\n- Attract, hire, and retain top service design talent.\n- Stay current with the latest trends and best practices in service design.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in service design, systems thinking, and user research.\n- A compelling portfolio of work that demonstrates a commitment to service design excellence.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing service design teams.\n"
  },
  {
    "role-name": "Chief Digital Officer (Cdo)",
    "description": "A Chief Digital Officer (CDO) is a senior executive responsible for leading the digital transformation of an organization. They are tasked with leveraging new technologies and data to drive growth, improve efficiency, and create better customer experiences. The CDO is a change agent who helps the organization adapt to the rapidly evolving digital landscape.\n",
    "industry": "Enterprise, Government\n",
    "medium": "Digital\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and execute a comprehensive digital transformation strategy.\n- Identify and capitalize on new digital opportunities, business models, and technologies.\n- Lead the adoption of digital technologies and processes across the organization.\n- Drive a data-driven culture, leveraging analytics and insights to inform decision-making.\n- Oversee the development and management of the company's digital product portfolio.\n- Foster a culture of innovation and continuous learning.\n- Collaborate with other executives to align digital initiatives with overall business strategy.\n",
    "similar-to-other-roles": null,
    "skills": "- Extensive experience in leading large-scale digital transformation initiatives.\n- Deep understanding of current and emerging digital technologies, including AI, data analytics, and cloud computing.\n- Strong strategic thinking and business acumen.\n- Proven ability to lead and manage change in a complex organization.\n- Excellent communication, influencing, and stakeholder management skills.\n- A data-driven mindset and a passion for innovation.\n- Experience in a senior leadership role.\n"
  },
  {
    "role-name": "Lighting Designer",
    "description": "A Lighting Designer is a creative professional who specializes in the design and implementation of lighting for a variety of environments, including architecture, theater, film, and events. They are experts in the art and science of light, and they use that knowledge to create mood, atmosphere, and visual interest. They are passionate about using light to transform spaces and enhance experiences.\n",
    "industry": "Architecture, Theater\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Develop and execute lighting concepts for a wide range of projects.\n- Create detailed lighting plans, specifications, and renderings.\n- Select and specify lighting fixtures and control systems.\n- Collaborate with architects, interior designers, and other professionals to ensure that lighting is integrated into the overall design.\n- Oversee the installation and programming of lighting systems.\n- Stay current with the latest trends and technologies in lighting design.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of the principles of light, color, and perception.\n- Expertise in a variety of lighting design software, such as AutoCAD, Revit, or DIALux.\n- Strong creative and technical skills.\n- Excellent communication, presentation, and project management skills.\n- A passion for light and a creative mindset.\n- A portfolio that showcases a strong ability to design and execute lighting design projects.\n"
  },
  {
    "role-name": "Data Visualization Designer",
    "description": "A Data Visualization Designer is a creative professional who specializes in transforming complex data into clear, compelling, and actionable visual stories. They bridge the gap between data science and design, using their skills to create intuitive and engaging charts, graphs, dashboards, and infographics. They are masters of visual storytelling, with a deep understanding of how to communicate insights and trends in a way that is both beautiful and easy to understand.\n",
    "industry": "Media, Finance, Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of data visualizations, from simple charts to complex interactive dashboards.\n- Collaborate with data scientists, analysts, and other stakeholders to understand the data and the stories it can tell.\n- Translate complex data and research findings into clear and compelling visual narratives.\n- Ensure that all data visualizations are accurate, accessible, and easy to understand.\n- Stay current with the latest trends and best practices in data visualization and information design.\n- Explore new and innovative ways to visualize data.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in data visualization principles and best practices.\n- Proficiency in data visualization tools, such as Tableau, D3.js, or Flourish.\n- Strong graphic design skills, with a keen eye for typography, color, and layout.\n- A deep understanding of information design and visual storytelling.\n- Strong analytical and problem-solving skills.\n- Excellent communication and collaboration skills.\n- A portfolio that demonstrates a strong ability to turn complex data into compelling visual stories.\n"
  },
  {
    "role-name": "Usability Researcher",
    "description": "A Usability Researcher is a user experience professional who specializes in the evaluation of the usability of products, services, and experiences. They are experts in a wide range of usability testing methods, and they use that knowledge to identify and prioritize usability issues. They are passionate about creating products that are easy and enjoyable to use, and they are skilled in a variety of research and analysis tools.\n",
    "industry": "Tech\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Plan and conduct a wide range of usability tests, from moderated and unmoderated tests to heuristic evaluations and cognitive walkthroughs.\n- Analyze and synthesize usability data to identify and prioritize usability issues.\n- Communicate usability findings and recommendations to designers, product managers, engineers, and other stakeholders in a clear and compelling way.\n- Collaborate with other researchers and designers to create a comprehensive understanding of the user experience.\n- Stay current with the latest trends and best practices in usability testing.\n- Advocate for a user-centered and iterative approach to design.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in a variety of usability testing methods.\n- Strong analytical and synthesis skills.\n- Excellent communication, collaboration, and storytelling skills.\n- A deep sense of empathy and a passion for understanding people.\n- A portfolio that demonstrates a strong ability to identify and communicate usability issues.\n- Experience with a variety of research tools and technologies.\n"
  },
  {
    "role-name": "Ergonomics Designer",
    "description": "An Ergonomics Designer is a specialist who applies the principles of ergonomics and human factors to the design of products, workplaces, and systems. They are focused on creating solutions that are safe, comfortable, and efficient for people to use. They are human-centered designers with a deep understanding of human anatomy, physiology, and psychology.\n",
    "industry": "Industrial, Automotive\n",
    "medium": "Physical\n",
    "org-level": "IC\n",
    "responsibilities": "- Conduct research and analysis to understand the physical and cognitive capabilities and limitations of users.\n- Apply ergonomic principles to the design of products, workplaces, and systems.\n- Create and test prototypes to evaluate the usability, safety, and comfort of designs.\n- Collaborate with industrial designers, engineers, and other stakeholders to ensure that ergonomic considerations are integrated into the design process.\n- Stay current with the latest research and best practices in ergonomics and human factors.\n- Ensure that designs comply with relevant safety and accessibility standards.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of ergonomics and human factors principles.\n- Expertise in a variety of research methods, such as task analysis, user observation, and biomechanical analysis.\n- Strong analytical and problem-solving skills.\n- Excellent communication and collaboration skills.\n- A passion for creating safe, comfortable, and efficient products and systems.\n- A degree in ergonomics, human factors, or a related field is often required.\n"
  },
  {
    "role-name": "World Builder",
    "description": "A World Builder is a creative professional who specializes in the design and creation of fictional worlds. They are responsible for creating the lore, history, geography, and culture of a world, as well as the characters and creatures that inhabit it. They are masters of imagination, with a deep understanding of storytelling, mythology, and the principles of world design. They are passionate about creating worlds that are not only believable, but also immersive and engaging.\n",
    "industry": "Gaming, Metaverse\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of fictional worlds, from high fantasy to science fiction.\n- Collaborate with writers, artists, and other creatives to bring the world to life.\n- Develop and execute a cohesive and consistent vision for the world.\n- Stay current with the latest trends and best practices in world building.\n- Prepare and present world-building materials to clients and internal stakeholders.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of world building, including history, geography, and culture.\n- A strong portfolio that showcases a range of world-building skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for storytelling.\n- Meticulous attention to detail.\n- A deep and wide-ranging knowledge of history, mythology, and a variety of cultures.\n"
  },
  {
    "role-name": "Motion Designer",
    "description": "A Motion Designer is a creative professional who brings static graphics to life through animation. They are responsible for creating a wide range of animated content, from explainer videos and UI animations to title sequences and visual effects. They are masters of movement, with a deep understanding of the principles of animation and a passion for creating dynamic and engaging visual experiences.\n",
    "industry": "Advertising, Tech, Film\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of animated content, including explainer videos, UI animations, title sequences, and visual effects.\n- Collaborate with art directors, editors, and other stakeholders to develop and execute motion design concepts.\n- Stay current with the latest trends and techniques in motion design.\n- Manage multiple projects and deadlines.\n- Prepare files for a variety of platforms and formats.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of animation, including timing, spacing, and easing.\n- Proficiency in motion design software, such as Adobe After Effects, Cinema 4D, or Blender.\n- A strong portfolio that showcases a range of motion design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for motion.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Vr Designer",
    "description": "A VR Designer is a creative professional who specializes in the design of virtual reality (VR) experiences. They are responsible for creating immersive and interactive worlds that transport users to another place. They are masters of the virtual realm, with a deep understanding of 3D design, interaction design, and the psychology of presence. They are passionate about creating VR experiences that are not only beautiful, but also believable and engaging.\n",
    "industry": "Gaming, Tech\n",
    "medium": "Digital\n",
    "org-level": "IC\n",
    "responsibilities": "- Design and create a wide range of VR experiences, from games and simulations to training and social applications.\n- Collaborate with artists, programmers, and other team members to bring VR worlds to life.\n- Develop and execute VR design concepts from initial sketch to final implementation.\n- Stay current with the latest trends and techniques in VR design.\n- Prepare and present design concepts to clients and internal stakeholders.\n- Manage multiple projects and deadlines.\n",
    "similar-to-other-roles": null,
    "skills": "- Expertise in the principles of VR design, including immersion, presence, and interaction.\n- Proficiency in 3D modeling and game engines, such as Unity or Unreal Engine.\n- A strong portfolio that showcases a range of VR design skills and a commitment to quality.\n- Excellent communication and collaboration skills.\n- A creative mindset and a passion for VR.\n- Meticulous attention to detail.\n"
  },
  {
    "role-name": "Cx Designer",
    "description": "A CX Designer, or Customer Experience Designer, is a user-centered design professional who focuses on creating holistic and seamless experiences for customers across all channels and touchpoints. They are empathetic and strategic thinkers who use a variety of design and research methods to understand the needs and motivations of customers. They are the architects of the customer journey, designing every interaction to be as intuitive, enjoyable, and valuable as possible.\n",
    "industry": "Retail, Service, Tech\n",
    "medium": "Service\n",
    "org-level": "IC\n",
    "responsibilities": "- Conduct user research to understand the needs, behaviors, and pain points of customers.\n- Create user personas, journey maps, and other design artifacts to communicate customer insights.\n- Design and prototype cross-channel experiences that are both user-friendly and aligned with business goals.\n- Collaborate with product managers, engineers, and other stakeholders to bring CX designs to life.\n- Conduct usability testing and gather feedback to iterate on and improve the customer experience.\n- Advocate for the customer throughout the product development process.\n",
    "similar-to-other-roles": null,
    "skills": "- A deep understanding of user-centered design principles and methodologies.\n- Expertise in user research, service design, and interaction design.\n- Strong empathy and a passion for understanding the needs of customers.\n- Excellent communication, collaboration, and storytelling skills.\n- Proficiency in design and prototyping tools, such as Figma, Sketch, or Adobe XD.\n- A portfolio that demonstrates a strong understanding of CX design and a commitment to creating great user experiences.\n"
  },
  {
    "role-name": "Head Of Customer Experience",
    "description": "A Head of Customer Experience is a senior leader who is responsible for the overall customer experience (CX) vision, strategy, and execution for a company. They are the ultimate advocate for the customer, with a passion for building and leading high-performing CX teams. They are responsible for setting the bar for CX excellence and for ensuring that the CX team is creating end-to-end experiences that are both user-friendly and valuable to the business.\n",
    "industry": "Service, Tech\n",
    "medium": "Service\n",
    "org-level": "Strategic\n",
    "responsibilities": "- Develop and articulate the CX vision and strategy for the organization.\n- Lead and mentor a team of CX professionals, including designers, researchers, and strategists, providing guidance, feedback, and career development.\n- Oversee the design and implementation of all CX initiatives, ensuring a high standard of quality and consistency.\n- Collaborate with other leaders in product, marketing, and operations to ensure a cohesive and integrated customer experience.\n- Champion a customer-centric culture throughout the organization.\n- Attract, hire, and retain top CX talent.\n- Stay current with the latest trends and best practices in CX.\n",
    "similar-to-other-roles": null,
    "skills": "- Strong leadership and team management skills.\n- Deep expertise in customer experience, service design, and user research.\n- A compelling track record of improving customer satisfaction and loyalty.\n- Excellent communication, presentation, and storytelling skills.\n- Strong strategic thinking and business acumen.\n- A passion for building and mentoring high-performing CX teams.\n"
  }
]